---
layout: post
status: publish
published: true
title: Symmetry - Marcus du Sautoy
author:
  display_name: FredrikMeyer
  login: FredrikMeyer
  email: hrmeyer@gmail.com
  url: ''
author_login: FredrikMeyer
author_email: hrmeyer@gmail.com
wordpress_id: 38
wordpress_url: http://cube.fredrikmeyer.net/?p=38
date: '2010-08-02 22:09:35 +0200'
date_gmt: '2010-08-02 20:09:35 +0200'
categories:
- Anmeldelser
tags: []
comments: []
---
<p><a href="http://fredrikm.files.wordpress.com/2010/08/symmetry.jpg"><img class="alignright size-medium wp-image-283" title="symmetry" src="http://fredrikm.files.wordpress.com/2010/08/symmetry.jpg?w=198" alt="" width="198" height="300" /></a>Jeg har nylig fullf&oslash;rt boken "<a href="http://www.amazon.com/Symmetry-Journey-into-Patterns-Nature/dp/0060789417/ref=sr_1_cc_2?ie=UTF8&amp;qid=1280781618&amp;sr=1-2-catcorr">Symmetry - A journey into the patterns of nature</a>" av Marcus du Sautoy. Jeg begynte &aring; lese boken p&aring; flyet hjem fra Bangkok (p&aring; grunn av heldige omstendigheter satt jeg p&aring; Business Class), og fullf&oslash;rte den for noen dager siden.</p>
<p>Boken er en perle &aring; lese for alle matematikkstudenter - og ogs&aring; andre matematikkinteresserte. Den er en fin blanding av <a href="http://en.wikipedia.org/wiki/History_of_mathematics">matematikkhistorie</a>, matematikken bak symmetri (fortalt sv&aelig;rt lettfattelig) og hvordan det er &aring; v&aelig;re matematiker. Sistnevnte ingrediens er kanskje den mest velsmakende av alle tre.</p>
<p>Som tittelen hinter til, handler boken om symmetri, og hva det egentlig &eacute;r. "Vanlige", uoppl&aelig;rte mennesker, har en vag definisjon i bakhodet, og tenker kanskje p&aring; speil og blomster. Boken pr&oslash;ver &aring; fortelle oss hva en matematiker mener med symmetri, og hvordan man har laget et matematisk begrep som gj&oslash;r at man kan regne med "symmetrier". Man snakker om <a href="http://en.wikipedia.org/wiki/Symmetry_group">symmetrigrupper</a>, og <a href="http://en.wikipedia.org/wiki/Classification_of_finite_simple_groups">klassifiseringen av de endelige simple gruppene</a>.</p>
<p>Matematikkdelen av boken er enkel, og det aller meste er forst&aring;elig for de aller fleste. Likevel tror jeg det kan v&aelig;re en fordel &aring; kjenne noen av begrepene (gruppeteori, spesielt) n&aring;r man leser boken slik at man forst&aring;r hva den snakker om. Da blir det virkelig spennende!</p>
<p><a href="http://fredrikm.files.wordpress.com/2010/08/marcusdusautoy.jpg"><img class="alignright size-thumbnail wp-image-284" title="Marcus du Sautoy" src="http://fredrikm.files.wordpress.com/2010/08/marcusdusautoy.jpg?w=109" alt="" width="109" height="150" /></a>Historiedelene av boken forteller hvordan man har arbeidet med symmetribegrepet opp gjennom historien, hvordan det f&oslash;rte til at vi begynte &aring; telle (ved at vi ser likheter mellom enkeltting), og hvordan symmetribegrepet hjalp oss &aring; bevise at femtegradslignigen ikke har noen l&oslash;sningsformel).</p>
<p>du Sautoy forteller hvordan det er &aring; arbeide som matematiker. Om hvordan det er &aring; reise verden rundt p&aring; konferanser, om s&aelig;re matematikere, og hvordan det er &aring; jobbe p&aring; et universitet.</p>
<p>Som en subtil symmetrisk detalj starter og slutter boken p&aring; samme begivenhet.</p>
<p>Anbefales.</p>
