---
layout: post
status: publish
published: true
title: Matematikk, en veldig kort innføring
author: Fredrik Meyer
author_login: FredrikMeyer
author_email: hrmeyer@gmail.com
wordpress_id: 34
wordpress_url: http://cube.fredrikmeyer.net/?p=34
date: '2010-05-16 17:39:15 +0200'
date_gmt: '2010-05-16 15:39:15 +0200'
categories:
- Anmeldelser
tags: []
comments: []
---
<p><a href="http://fredrikm.files.wordpress.com/2010/05/averyshortintroductionmath.jpg"><img style="float:right;" class="alignright size-medium wp-image-205" title="averyshortintroductionmath" src="http://fredrikm.files.wordpress.com/2010/05/averyshortintroductionmath.jpg?w=209" alt="" width="209" height="300" /></a>
  Jeg fullførte akkurat boken "<a href="http://www.amazon.com/Mathematics-Short-Introduction-Timothy-Gowers/dp/0192853619/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1274027338&amp;sr=8-1">Mathematics - A Very Short Introduction</a>" &nbsp;av <a href="http://en.wikipedia.org/wiki/Timothy_Gowers">Timothy Gowers</a> i den velkjente very short-serien. Selv om boken ikke akkurat ga meg stort faglig nytt (siden jeg studerer emnet p&aring; universitetsniv&aring;), ga den meg innsikt i formidling av matematikk. Gowers har klart det ikke veldig mange klarer, nemlig &aring; formidle essensen av hvordan profesjonelle matematikere arbeider, og hva matematikk <em>er</em> (bare s&aring; det er sagt, s&aring; er jeg (enn&aring;) ikke noen profesjonell matematiker) - og det p&aring; en veldig forst&aring;elig m&aring;te.</p>
<p>Et gjennomgangbudskap i boken er den matematiske metode, noe han ogs&aring; kaller "the abstract method". Matematikk g&aring;r ut p&aring; &aring; velge seg noen aksiomer, (finne ut om disse er kompatible med hverandre), og utlede proposisjoner ut fra disse. Han poengterer at det ikke er relevant hva ting <em>er</em>, men heller hvilke regler de adlyder. Et eksempel: det er ikke viktig &aring; vite hva tall <em>er</em>, det er viktig &aring; vite for eksempel at $$a(b+c)=ab+ac.$$</p>
<p>Boken avsluttes med en "ofte stilte spørsm&aring;l"-del som, ihvertfall for meg, var veldig interessant &aring; lese. Noen av spørsm&aring;lene han prøver &aring; svare p&aring; er "Is it true that mathematicians are past it by 30?", "Why are there so few women in mathematics?", "Are famous mathematical problems ever solved by amateurs?".</p>
<p>Boken kan leses av alle som har fullført ungdomsskolen. Om man er interessert i matematikk og&nbsp; liker &aring; lese korte l&aelig;rerike bøker, &nbsp;s&aring; passer denne for deg =)</p>
<p>Boken koster kun ca 55 norske kroner p&aring; Amazon. Jeg vil forøvrig ogs&aring; anbefale interesserte i &aring; ta en titt p&aring; <a href="http://gowers.wordpress.com/">bloggen</a> til Gowers.</p>
