---
layout: post
status: publish
published: true
title: Storebror dreper!
author:
  display_name: FredrikMeyer
  login: FredrikMeyer
  email: hrmeyer@gmail.com
  url: ''
author_login: FredrikMeyer
author_email: hrmeyer@gmail.com
wordpress_id: 257
wordpress_url: http://fredrikm.wordpress.com/?p=257
date: '2010-06-14 10:38:32 +0200'
date_gmt: '2010-06-14 09:38:32 +0200'
categories:
- anmeldelser
tags: []
comments:
- id: 325
  author: B&aring;rd Larsen
  author_email: bard@civita.no
  author_url: ''
  date: '2010-07-26 10:34:31 +0200'
  date_gmt: '2010-07-26 09:34:31 +0200'
  content: |-
    Hei Fredrik!
    Hyggelig at du liker den lille boken (synd at biblioktekaren ikke ville registrere den).

    N&aring;r det gjelder dette med kommunismen som en d&aring;rlig ide er jeg selvsagt helt enig med deg i det. Husk bare at bokens m&aring;lgruppe er skolungdom eller unge voksne, og det er viktig &aring; v&aelig;re &aring;pen for diskusjon med et slikt utgangspunkt. Jeg syns n&aring; allikevel at det kommer godt frem at kommunismen er en d&aring;r&oslash;ig ide.
    Til h&oslash;sten kommer jeg med en oppf&oslash;lger, denne gang med et voksent publikum som m&aring;lgruppe, og da blir tonen en helt annen!
    ; )

    Mvh
    B&aring;rd Larsen, civita
---
<p><a href="http://fredrikm.files.wordpress.com/2010/06/total.jpg"><img class="alignright size-full wp-image-258" title="Totalitarisme" src="http://fredrikm.files.wordpress.com/2010/06/total.jpg" alt="" width="142" height="220" /></a>I helgen leste jeg boken "<a href="http://www.civita.no/publikasjoner/view/59/">Storebror dreper - Om totalitarisme</a>", utgitt av <a href="http://www.civita.no/">Civita</a>, skrevet av B&aring;rd Larsen. Bibliotekaren p&aring; skolen jeg jobber p&aring; sa at boken ikke var registrert, og om jeg var interessert kunne jeg bare ta den. S&aring; jeg gjorde det.</p>
<p>Boken var veldig interessant, for &aring; si det f&oslash;rst. Den tar for seg flere totalit&aelig;re regimer, og forteller om grusomhetene disse stod bak. Det er lagt ekstra vekt p&aring; kommunistiske regimer, da en unders&oslash;kelse har vist at norske skoleelever vet mer om nazistenes herjinger enn om grusomhetene under f.eks Stalin og Pol Pot.</p>
<p>Boken egner seg utmerket om du &oslash;nsker en kort og lettlest informasjonskilde til totalit&aelig;re staters grusomheter. Derimot virker det som om den beg&aring;r den klassiske feilen med uttalelser som "kommunisme er en god id&eacute;, men fungerer ikke i praksis". Det man m&aring; f&aring; inn i hodene, er at kommunisme p&aring; alle m&aring;ter er en d&aring;rlig id&eacute;. (vel, om form&aring;let er sult og undertrykkelse, er kommunisme en fortreffelig id&eacute;. Om form&aring;let er velstand og lykke for befolkningen, er det en elendig id&eacute;.)</p>
<p>Man leser boken p&aring; et par timer, og den finnes ogs&aring; til<a href="http://www.civita.no/publikasjoner/view/59/"> gratis nedlastning</a> p&aring; Civitas hjemmesider. Den er underholdende* (!) og l&aelig;rerik lesning.</p>
<p>* Man kan bare le n&aring;r man leser om den ungarske metereologen som blir arrestert for &aring; ha meldt at "det kommer en iskald luftstr&oslash;m fra <a href="http://www.vg.no/nyheter/utenriks/artikkel.php?artid=10008899">nord&oslash;stlig</a> retning, fra Sovjetunionen".</p>
