---
layout: post
status: publish
published: true
title: Ian Stewart - From here to infinity
author:
  display_name: FredrikMeyer
  login: FredrikMeyer
  email: hrmeyer@gmail.com
  url: ''
author_login: FredrikMeyer
author_email: hrmeyer@gmail.com
wordpress_id: 40
wordpress_url: http://cube.fredrikmeyer.net/?p=40
date: '2010-09-26 19:36:58 +0200'
date_gmt: '2010-09-26 17:36:58 +0200'
categories:
- Anmeldelser
tags: []
comments: []
---
<p><a href="http://fredrikm.files.wordpress.com/2010/09/ianstewart.jpg"><img class="alignright size-thumbnail wp-image-300" title="ianstewart" src="http://fredrikm.files.wordpress.com/2010/09/ianstewart.jpg?w=135" alt="" width="135" height="150" /></a>Jeg har akkurat fullf&oslash;rt boken "<a href="http://en.wikipedia.org/wiki/From_Here_to_Infinity_(book)">From here to infinity - A Guide to Today's Mathematics</a>" av <a href="http://en.wikipedia.org/wiki/Ian_Stewart_(mathematician)">Ian Stewart</a>. Tittelen er veldig beskrivende: den handler stort sett om hva matematikere har drevet med de siste par hundre &aring;rene, og tar opp et sv&aelig;rt bredt spektrum av temaer (primtall (dvs. <a href="http://en.wikipedia.org/wiki/Riemann_hypothesis">Riemann-hypotesen</a>), <a href="http://en.wikipedia.org/wiki/Knot_theory">knuteteori</a>, topologi (f.eks<a href="http://en.wikipedia.org/wiki/Four_color_theorem"> 4-fargeteoremet</a>), algebra (f.eks ul&oslash;seligheten av <a href="http://en.wikipedia.org/wiki/Quintic_equation">femtegradslikningen</a>), og beregnbarhet (f.eks<a href="http://en.wikipedia.org/wiki/G&ouml;del's_incompleteness_theorems"> G&ouml;dels kjente teorem</a>)).</p>
<p>Boken er veldig inspirerende for en vordende matematiker. Vi f&aring;r h&oslash;re om hvor lang tid det tar &aring; bevise viktige resultater, om ul&oslash;ste problemer, og noe om hvordan en matematiker arbeider.</p>
<p><a href="http://fredrikm.files.wordpress.com/2010/09/fromheretoinfinity.jpg"><img class="alignright size-thumbnail wp-image-299" title="fromheretoinfinity" src="http://fredrikm.files.wordpress.com/2010/09/fromheretoinfinity.jpg?w=101" alt="" width="101" height="150" /></a>Boken ble f&oslash;rste gang utgitt i 1987, s&aring; noe av informasjonen er allerede utdatert. For eksempel er b&aring;de <a href="http://en.wikipedia.org/wiki/Poincar&eacute;_conjecture">Poincar&eacute;-formodningen</a> og <a href="http://en.wikipedia.org/wiki/Fermat's_Last_Theorem">Fermats siste sats</a> l&oslash;ste problemer i dag. Men det er bare motiverende! (selv i dag har matematikere noe &aring; gj&oslash;re)</p>
<p>Begrepene i boken introduseres p&aring; en lettlest m&aring;te, og kan leses av alle med allmennkunnskapene i orden. &nbsp;Jeg koseleste boken i den forstand at jeg ikke tok meg tid til &aring; "gjennomforst&aring;" hvert eneste nye begrep som ble innf&oslash;rt.</p>
<p>Forfatteren fokuserer mye p&aring; hvor mye matematikken har blitt anvendt i samfunnet rundt oss, og beskriver hvordan utviklingen av ny matematikk har blitt inspirert av fremgang i fysikk/biologi/&oslash;konomi/osv. &nbsp;Han sp&aring;r at "det tjuef&oslash;rste &aring;rhundrets matematikk" (dvs. dagens og framover!) vil bli mye preget av samspillet mellom datamaskiner/fysikk og moderne teknologi. Selv har jeg ikke dette inntrykket, men det er likevel interessant &aring; lese om hvordan man p&aring; slutten av 80-tallet s&aring; for seg framtidens matematikk.</p>
<p>Boken kan l&aring;nes p&aring; &nbsp;Matematisk Bibliotek p&aring; Blindern. (n&aring;r jeg har levert den tilbake!)</p>
