---
layout: post
status: publish
published: true
title: Spring Awakening og USA
author:
  display_name: FredrikMeyer
  login: FredrikMeyer
  email: hrmeyer@gmail.com
  url: ''
author_login: FredrikMeyer
author_email: hrmeyer@gmail.com
wordpress_id: 24
wordpress_url: http://fredrikm.wordpress.com/?p=24
date: '2010-02-20 18:34:35 +0100'
date_gmt: '2010-02-20 17:34:35 +0100'
categories:
- anmeldelser
- personlig
tags: []
comments: []
---
<p><img class="size-medium wp-image-25 alignright" title="Spring Awakening" src="http://fredrikm.files.wordpress.com/2010/02/sa-e1266686424391.jpg?w=300" alt="" width="300" height="201" />I g&aring;r var jeg og to <a href="http://www.frihet.org/">gode</a> <a href="http://www.olemartinmoen.com/">venner</a> (og to av deres venner) og s&aring; p&aring; <a href="http://www.springawakening.com/">Spring Awakening</a>. Etter all omtalen i aviser om at denne musikalen framstiller en "seksuell oppv&aring;kning" og er "modig", m&aring; jeg innr&oslash;mme at jeg er moderat skuffet. Musikalen har et deilig preg av ungdommelighet og l&oslash;ssluppenhet, men klarer ikke &aring; spille dette helt ut. Plottet er svakt udefinert, og temaet er litt "out of date". Den superstrenge foreldregenerasjonen er forlengst utd&oslash;dd, og det blir da vanskelig &aring; leve seg inn i situasjonen til skuespillerne. Handlingen blir ogs&aring; litt vel mye elendighet og lite nytelse og kos.</p>
<p>Sangene er heller ikke "de beste". Den aller f&oslash;rste sangen som synges, er faktisk veldig fin, men ellers er sangene vel mye "rocka". (rock skal visstnok v&aelig;re en ungdommelig sjanger). Men likevel: Musikalen er nok verdt billettprisen. Den er koselig, og fremmer tross alt et syn p&aring; sex som er mye bedre enn selv det som er utbredt i dag. Ogs&aring; et stort pluss er at vi f&aring;r se to gutter kysse <3! (mer spesifikt, den supers&oslash;te oppe til h&oslash;yre p&aring; bildet under)</p>
<p><a href="http://fredrikm.files.wordpress.com/2010/02/sa2.jpg"><img class="aligncenter size-medium wp-image-26" title="Spring Awakening - deilig plakat" src="http://fredrikm.files.wordpress.com/2010/02/sa2.jpg?w=207" alt="" width="207" height="300" /></a> Og til slutt en liten gladnyhet:</p>
<p>Jeg har blitt tatt opp som utvekslingsstudent &nbsp;til v&aring;ren 2011. Det betyr at om litt under et &aring;r reiser jeg til USA til <a href="http://illinois.edu/">University of Illinois at Urbana-Champaign</a>, og skal studere mitt siste semester av bachelorgraden der. Det blir koooos!</p>
