---
layout: post
status: publish
published: true
title: Fjerne tanker fra et land
author:
  display_name: FredrikMeyer
  login: FredrikMeyer
  email: hrmeyer@gmail.com
  url: ''
author_login: FredrikMeyer
author_email: hrmeyer@gmail.com
wordpress_id: 416
wordpress_url: http://sphere.fredrikmeyer.net/?p=416
date: '2011-01-19 04:46:11 +0100'
date_gmt: '2011-01-19 04:46:11 +0100'
categories:
- personlig
- USA-tur
tags: []
comments:
- id: 341
  author: S&oslash;s
  author_email: theresesem@gmail.com
  author_url: ''
  date: '2011-01-19 12:11:04 +0100'
  date_gmt: '2011-01-19 12:11:04 +0100'
  content: Speiderfredrik kommer ut av skapet, knuteteori says it all.
- id: 348
  author: Lovise
  author_email: lovise.meyer11@gmail.com
  author_url: ''
  date: '2011-01-27 09:34:21 +0100'
  date_gmt: '2011-01-27 15:34:21 +0100'
  content: Fin blogg Fredrik! Kult du skriver om vitenskap ;)
---
<p><a href="http://sphere.fredrikmeyer.net/wp-content/uploads/DSC00578.jpg"><img class="alignright size-medium wp-image-417" title="Skrivebord" src="http://sphere.fredrikmeyer.net/wp-content/uploads/DSC00578-225x300.jpg" alt="" width="225" height="300" /></a>N&aring; har jeg v&aelig;rt over en uke i det fjerne utland, p&aring; den siden av havet hvor all kulturen kommer fra. Riktignok er mye forskjellig her. Mat er veldig billig - kanskje p&aring; niv&aring; med prisene i &oslash;st-Europa.<!--more--></p>
<p>Ihvertfall, jeg har ankommet Urbana-Champaign, eller hva n&aring; denne byen heter. Det har jeg enn&aring; ikke skj&oslash;nt. Det er visstnok to byer, med universitetet som deler dem i to i midten. S&aring;nn omtrent. Campus her er veldig stort, mye st&oslash;rre enn UiO med kun 20.000 studenter. Her er det n&aelig;rmere 40.000.</p>
<p>Jeg bor like ved en enorm "dining hall", hvor jeg har 10 buffeer i uken (frokost, lunsj eller middag etter &oslash;nske). Jeg har s&aring;langt benyttet meg av frokosten og lunsjen. Mye &aring; velge mellom: til frokost laget jeg meg vafler p&aring; vaffeljern "klar til bruk" i spisesalen, og til lunsj tok jeg meg barbeque-kylling og hadde ostesaus og "hjemmelagede" potetchips til. Selvf&oslash;lgelig serverte de ogs&aring; hamburgere der.</p>
<p><a href="http://sphere.fredrikmeyer.net/wp-content/uploads/DSC00579.jpg"><img class="alignright size-thumbnail wp-image-418" title="Seng" src="http://sphere.fredrikmeyer.net/wp-content/uploads/DSC00579-150x150.jpg" alt="" width="150" height="150" /></a>Jeg bor p&aring; en "dorm" hvor jeg deler rom med en person, og bad med en ikke tellbar mengde personer. Det g&aring;r fors&aring;vidt greit. Jeg har v&aelig;rt rimelig heldig og f&aring;tt en rolig "roomie". Bildene til h&oslash;yre er fra rommet "v&aring;rt".</p>
<p>Ellers har jeg hatt mine to f&oslash;rste forelesninger i dag. De to neste kommer i morgen. S&aring;langt virker det som om jeg kommer til &aring; ha stort faglig utbytte av utvekslingen. Knuteteori, MATH428, er det ene faget, et honors-kurs. Et noe overfladisk &nbsp;overblikk av knuteteori. Homologisk algebra er det andre. Det virker veldig interessant. For de eventuelt interesserte (finnes det noen tro?) kommer jeg til &aring; legge ut forelesningsnotater p&aring; nett; se min <a href="http://cube.fredrikmeyer.net/">matteblogg</a>).</p>
<p>For&oslash;vrig legger jeg ut bilder fra oppholdet p&aring; <a href="http://www.flickr.com/photos/fredrikmeyer/">Flickr</a>. Under er to bilder fra Chicago som jeg ikke la ved forrige bloggpost. Det ene forestiller maten jeg holdt meg mett p&aring; en hel dag. Det andre er det s&oslash;te advarselsskiltet.</p>
<p><a href="http://sphere.fredrikmeyer.net/wp-content/uploads/DSC00573.jpg"><img class="size-medium wp-image-420" title="Mat fra Chicago" src="http://sphere.fredrikmeyer.net/wp-content/uploads/DSC00573-300x225.jpg" alt="" width="300" height="225" /></a><a href="http://sphere.fredrikmeyer.net/wp-content/uploads/DSC00571.jpg"><img class="size-medium wp-image-421" title="S&oslash;t" src="http://sphere.fredrikmeyer.net/wp-content/uploads/DSC00571-300x225.jpg" alt="" width="300" height="225" /></a></p>
