---
layout: post
status: publish
published: true
title: Anonymitet
author:
  display_name: FredrikMeyer
  login: FredrikMeyer
  email: hrmeyer@gmail.com
  url: ''
author_login: FredrikMeyer
author_email: hrmeyer@gmail.com
wordpress_id: 488
wordpress_url: http://sphere.fredrikmeyer.net/?p=488
date: '2011-08-09 18:00:24 +0200'
date_gmt: '2011-08-09 16:00:24 +0200'
categories:
- meninger
tags: []
comments:
- id: 565
  author: Nikolai
  author_email: kolja1988@gmail.com
  author_url: http://nikolaissuperpop.blogspot.com/
  date: '2011-08-10 13:47:49 +0200'
  date_gmt: '2011-08-10 11:47:49 +0200'
  content: "Joda, dette er nok i og for seg, hvertfall delvis riktig. Ulempen er bare
    at ekstrem nasjonalisme ikke er en rasjonell ideologi, i likhet med andre ekstreme
    ideologier. Det er ideologier som appellerer til f&oslash;lelser og romanitisisme.
    Ofte virker det f&aring;fengt &aring; diskutere med nasjonalister, kommunister,
    islamister, and the likes of it, rett og slett fordi en m&aring; stikke hull p&aring;
    fantasiboblene f&oslash;rst. I de moderne sofa-ekstremistenes tilfelle er disse
    boblene ofte nasjonen som reelt eksisterende i annen en relativ og analytisk forstand,
    og faktisk at middelaldersamfunn er bra, eller at &oslash;konomien kan fungere
    i en hermetikkboks. Samtidig er passiviteten som motstandsfolk m&oslash;ter ekstremistene
    med noe som g&aring;r igjen i historien. Ogs&aring; i 1930-&aring;rene (ai, jeg
    tar den forbudte sammenligning) resignerte n&aelig;rmest antinazistene, p&aring;
    grunn av at det virket umulig &aring; diskutere mot den form for irrasjonalitet,
    men selvf&oslash;lgelig ogs&aring; av frykt. Hovedproblemet med nettdebattene
    er imidlertid at middelaldrende sofa-ekstremister sprer sine konspirasjonsteorier,
    og unge, naive mennesker kan finne p&aring; &aring; tro p&aring; dem, da anti-ekstremister
    ofte ikke gidder diskutere p&aring; disse nettdebattene, nettopp da de finner
    det hensiktsl&oslash;st. Ulempen er da nettopp at disse nettdebattene kan fungere
    som rekrutteringssted for ekstremisme. \r\n\r\nEn beslektet sak, som ikke direkte
    gjelder det du skriver, er at mange ser ut til &aring; mene at bare ekstremistene
    f&aring;r nok plattformer &aring; ytre seg p&aring;, skal de roe seg ned. Dette
    er &aring;penbart like mye en ideologisert virkelighetsforvrengning som noe annet.
    Det er ikke s&aring; langt fra den &aring;penbart gale, vestlige, psykologiske
    ideen om at et frustrert menneske kan bli friskt ved &aring; f&aring; ut frustrasjonen
    sin. Gi ham en punching bag, s&aring; skal alt bli bra. Dette er galt. Gjennom
    dette &oslash;ver han inn mer aggresjon. Slik kan ogs&aring; debatt fungere, spesielt
    om syke meninger f&aring;r st&aring; uimotsagt, og f&aring;r gjentas gang p&aring;
    gang. \r\n\r\nDet er et st&oslash;rre problem at \"fornuftige mennesker\" n&aelig;rmest
    ikke har ytret seg p&aring; disse debattene, enn at stakkars ekstremister ikke
    f&aring;r ytre seg."
- id: 566
  author: FredrikMeyer
  author_email: hrmeyer@gmail.com
  author_url: ''
  date: '2011-08-10 14:06:33 +0200'
  date_gmt: '2011-08-10 12:06:33 +0200'
  content: "Form&aring;let med rasjonell argumentasjon mot fremmedfiendtlige og andre
    g&aelig;rninger er ikke n&oslash;dvendigvis &aring; stikke hull p&aring; deres
    bobler, men &aring; argumentere mot dem slik at andre mennesker kan se hullene
    i argumentasjonen deres.\r\n\r\nF.eks er en typisk kommentar dette: \"alle voldtekstmenn
    er innvandrere!!! f&aring; dem ut!\". Det er en viss sannhet i p&aring;standen,
    men konklusjonen er typisk. Her m&aring; rasjonelle mennesker gripe inn og poengtere
    at den motsatte implikasjonen ikke gjelder. De aller fleste innvandrere er lovlydige
    og arbeidende mennesker som har flyktet fra en ofte grusom tilv&aelig;relse i
    h&aring;p om et bedre liv her."
---
<p>Dette innlegget ble sendt til Avisa Nordland den 9. august 2011.</p>
<h1 class="western">"Anonymitet</h1>
<p>Dag O. Johansen skriver i AN den 9. august at avisene burde nekte anonyme skribenter adgang til debattplassene. Etter Ut&oslash;ya-tragedien har det kommet p&aring; moten &aring; legge skylden p&aring; anonyme nettdebattanter &ndash; anonymitet skal visstnok gj&oslash;re det enklere &aring; v&aelig;re &aring;pent rasistisk.</p>
<p>Dette er en skummel tankegang. Problemet &ndash; alts&aring; menneskene med fordommer &ndash; forsvinner ikke. N&aring;r de ikke tidligere postet under fullt navn, hvorfor vil de n&aring; gj&oslash;re det? Man vil sikkert bli kvitt fremmedfiendtlige ytringer fra aviser og andre debattfora med en slik politikk, men det er ingen grunn til &aring; tro at grumset slutter &aring; eksistere. Tvert om &ndash; da blir g&aelig;rninger tvunget til &aring; leve i sin egen boble uten &aring; f&aring; verbal motstand fra fornuftige mennesker.</p>
<p>Man sloss ikke rasisme og fremmedfiendtlighet med utestenging, men med fornuftig og rasjonell debatt."</p>
