---
layout: post
status: publish
published: true
title: Tanker fra et fjernt land
author:
  display_name: FredrikMeyer
  login: FredrikMeyer
  email: hrmeyer@gmail.com
  url: ''
author_login: FredrikMeyer
author_email: hrmeyer@gmail.com
wordpress_id: 389
wordpress_url: http://sphere.fredrikmeyer.net/?p=389
date: '2011-01-12 05:06:30 +0100'
date_gmt: '2011-01-12 05:06:30 +0100'
categories:
- personlig
- USA-tur
tags: []
comments:
- id: 338
  author: Daniel
  author_email: aleksandersen@runbox.no
  author_url: http://my.opera.com/daniel/blog/
  date: '2011-01-12 07:59:47 +0100'
  date_gmt: '2011-01-12 07:59:47 +0100'
  content: Hvor er de obligatoriske fotoene av &lsquo;nylandet turist/utvekslingsstudent
    i nytt land?&rsquo;
- id: 339
  author: FredrikMeyer
  author_email: hrmeyer@gmail.com
  author_url: ''
  date: '2011-01-12 14:43:10 +0100'
  date_gmt: '2011-01-12 14:43:10 +0100'
  content: "Planla faktisk &aring; etterligne bloggerne p&aring; blogg.no og ha foto
    av meg hver eneste dag, hver eneste post, osv, men problemet er jo at jeg s&aring;
    sjeldent tar bilder av meg selv.\r\n\r\n(btw: I still look the same!)"
---
<p><a href="http://sphere.fredrikmeyer.net/wp-content/uploads/USAjan-012ed.jpg"><img class="alignright size-medium wp-image-390" title="Sn&oslash; i Chicago" src="http://sphere.fredrikmeyer.net/wp-content/uploads/USAjan-012ed-300x200.jpg" alt="" width="300" height="200" /></a>Mandag morgen ankom jeg Gardermoen. Dette er historien om hvordan jeg - lille meg - reiste fra Oslo til Chicago. Forh&aring;pentligvis vil dette bli en historie i flere deler. Den f&oslash;rste n&aring;, de resterende etterhvert, hvor jeg kommer til &aring; beskrive mitt liv som utvekslingsstudent p&aring; University of Illinois at Urbana-Champaign.&nbsp;<!--more--></p>
<p>Jeg begynner med en advarsel for pedantiske lesere (dere vet hvem dere er): Jeg kommer til &aring; skrive kronologisk, blande inn spontante tanker, og ellers ikke tenke mye p&aring; lesevennlighet (annet enn &aring; f&oslash;lge normale norske skriveregler). S&aring; vet dere det.</p>
<p><a href="http://sphere.fredrikmeyer.net/wp-content/uploads/sikkerhetskontroll.jpg"><img class="alignright size-medium wp-image-391" title="sikkerhetskontroll, heathrow" src="http://sphere.fredrikmeyer.net/wp-content/uploads/sikkerhetskontroll-300x300.jpg" alt="" width="300" height="300" /></a>Jeg ankom Gardermoen sv&aelig;rt tidlig. Jeg var der i &aring;ttetiden og flyet skulle dra 11:30. Tiden ble brukt til &aring; lese i <a href="http://en.wikipedia.org/wiki/Isaac_Asimov">Isaac Asimovs</a> "<a href="http://en.wikipedia.org/wiki/I,_Robot">I, robot</a>" (som jeg kommer til &aring; skryte av i en senere bloggpost). Ogs&aring; et par-tre Sudoku ble l&oslash;st. Flyet tok etterthvert av, og etter et par timer landet jeg i Heathrow, terminal 5. Der hadde tydeligvis spist steinsopp (eller tilsvarende) mens de planla sikkerhetskontrollen. Det er det mest ineffektive systemet jeg noensinne har sett. Bildet til h&oslash;yre skal pr&oslash;ve &aring; illustrere systemet. F&oslash;rst g&aring;r du inn en d&oslash;r, f&oslash;lger k&oslash;en, og s&aring; velger du deg en mindre k&oslash;. Der st&aring;r du og venter uten noe bedre &aring; gj&oslash;re. S&aring; slipper vaktene fram &eacute;n og &eacute;n person til b&aring;ndet for &aring; legge fra seg tingene sine og g&aring; gjennom. Mens alle ser p&aring;. Slikt tar tid.</p>
<p>Ihvertfall, jeg kom meg gjennom, og hadde tre timer &aring; sl&aring; ihjel. P&aring; Gardermoen hadde jeg kj&oslash;pt <a href="http://en.wikipedia.org/wiki/Richard_Dawkins">Richard Dawkins</a>' bok "<a href="http://en.wikipedia.org/wiki/River_Out_of_Eden">River out of Eden</a>", s&aring; jeg begynte &aring; lese p&aring; den. Den er forel&oslash;pig veldig god - akkurat som alt det andre han har skrevet - og jeg kommer nok til &aring; anmelde den ogs&aring; p&aring; et senere tidspunkt. Etterhvert begynte man &aring; fly til USA. P&aring; flyet ble jeg sittende sammen med en danske og hans norske kj&aelig;reste som snakket en morsom blanding av dansk og Troms&oslash;-dialekt. Hyggelig. British Airways var bra - grei mat, hyggelig betjening, og mye servering. Thai Air-personalet var dog hyggeligere.</p>
<p><a href="http://sphere.fredrikmeyer.net/wp-content/uploads/nocountry3-4.jpg"><img class="alignright size-medium wp-image-392" title="No country for old men" src="http://sphere.fredrikmeyer.net/wp-content/uploads/nocountry3-4-259x300.jpg" alt="" width="259" height="300" /></a>S&aring; landet jeg p&aring; O'Hare. Der ble vi m&oslash;tt av en enorm k&oslash;. Jeg stod i k&oslash; i over en time for &aring; komme inn i landet - og ble m&oslash;tt av en sinna og pedantisk grensekontroll&oslash;r. To tall &nbsp;som stod p&aring; et papir skulle v&aelig;re skrevet p&aring; to linjer p&aring; et annet papir, og det ble han sinna for at jeg ikke hadde skj&oslash;nt, tross at det p&aring; ingen m&aring;te var klart at dette skulle gj&oslash;res. Jeg kom ihvertfall inn i landet. Drosjesj&aring;f&oslash;ren var ikke stort bedre. Han spurte meg f&oslash;rst hvorfor jeg ikke tok buss (og h&oslash;rtes ut som om han hatet jobben sin), og n&aring;r adressen p&aring; hotellet var forvirrende, begynte han &aring; bannes og h&oslash;res kul ut (han h&oslash;rtes ikke kul ut - han h&oslash;rtes ut som en parodi p&aring; gangstaz i amerikanske musikkvideoer). Da vi kom fram, ba han meg forte meg ut av bilen - han hadde andre ting &aring; gj&oslash;re. Ikke noe tips fra meg. Til pass for ham. S&aring; kom jeg inn p&aring; hotellet - der ble jeg m&oslash;tt av en sv&aelig;rt hyggelig eldre dame. Hotellet var et typisk amerinsk hotell slik vi ser dem i filmer. Eksempel: "<a href="http://www.imdb.com/title/tt0477348/">No country for old men</a>" (bildet til h&oslash;yre).</p>
<p>S&aring; oppdaget jeg at jeg ikke hadde noen m&aring;te &aring; lade datamaskinen, mobilen, kameraet og barbermaskinen. De har jo dustete standarderer i dette landet. Dette problemet ble heldigvis l&oslash;st dagen etter rimelig raskt.</p>
<p><a href="http://sphere.fredrikmeyer.net/wp-content/uploads/USAjan-025ed.jpg"><img class="alignright size-medium wp-image-394" title="Bridge view" src="http://sphere.fredrikmeyer.net/wp-content/uploads/USAjan-025ed-300x200.jpg" alt="" width="300" height="200" /></a>I dag (dagen etter), &nbsp;har jeg stort sett g&aring;tt rundt i sentrum av Chicago. Jeg tok toget herfra (cirka en halvtime) og gikk av p&aring; Union Station. Som det kan ses p&aring; det &oslash;verste bildet, sn&oslash;dde det kraftig. Det har det gjort i hele dag. Jeg fikk et tatt et skikkelig fint bilde (h&oslash;yre) p&aring; vei til&nbsp;<a href="http://en.wikipedia.org/wiki/Field_Museum_of_Natural_History">Field Museum of Natural History</a>.</p>
<p>Museet var skikkelig interessant. De har verdens st&oslash;rste og mest komplette Tyrannosaurus Rex, <a href="http://en.wikipedia.org/wiki/Sue_(dinosaur)">Sue</a>. &nbsp;Det var virkelig interessant med alle de utstoppede dyrene (jeg ble hele tiden overrasket over st&oslash;rrelsen. Neshornet var jo enormt og grizzlybj&oslash;rnen var jo liten og s&oslash;t).</p>
<p>Kveldsmat p&aring; McDonalds. &nbsp;Planen for i morgen er &aring; bruke mindre penger, lese litt, og planlegge onsdagen, da jeg tar turen til Urbana - hvor jeg kommer til &aring; v&aelig;re de neste fem m&aring;nedene. Jeg ser de har et kurs i homologi i &aring;r - jeg h&aring;per jeg kan f&aring; lov til &aring; ta det. Det h&oslash;res skikkelig spennende ut.</p>
<p>Klemmer til alle. Og f&oslash;lg med, jeg vil sikkert legge ut anmeldelse av Asimov-boken i morgen.</p>
<p><a href="http://sphere.fredrikmeyer.net/wp-content/uploads/USAjan-040ed.jpg"><img class="aligncenter size-large wp-image-396" title="Darwin" src="http://sphere.fredrikmeyer.net/wp-content/uploads/USAjan-040ed-1024x598.jpg" alt="" width="640" height="373" /></a> (denne var en del av utstillingen p&aring; museet. Godt &aring; se at ihvertfall vitenskapsmuseene ikke sprer kreasjonisme.)</p>
