---
layout: post
status: publish
published: true
title: Freakonomics, kort anmeldelse
author:
  display_name: FredrikMeyer
  login: FredrikMeyer
  email: hrmeyer@gmail.com
  url: ''
author_login: FredrikMeyer
author_email: hrmeyer@gmail.com
wordpress_id: 480
wordpress_url: http://sphere.fredrikmeyer.net/?p=480
date: '2011-07-02 01:10:46 +0200'
date_gmt: '2011-07-02 06:10:46 +0200'
categories:
- anmeldelser
tags: []
comments: []
---
<p><a href="http://sphere.fredrikmeyer.net/wp-content/uploads/Freakonomics.jpg"><img class="size-full wp-image-481 alignright" title="Freakonomics" src="http://sphere.fredrikmeyer.net/wp-content/uploads/Freakonomics.jpg" alt="" width="200" height="296" /></a>I skrivende tidspunkt er jeg p&aring; bilferie med venner (blant annet <a href="http://www.frihet.org/">Thomas</a>, og <a href="http://www.olemartinmoen.com/">Ole Martin</a>), og da f&aring;r man naturlig nok mye tid til &aring; lese b&oslash;ker i baksetet. Etter et bes&oslash;k p&aring; <a href="http://www.barnesandnoble.com/">Barnes &amp; Nobles</a> fant jeg boken <a href="http://www.amazon.com/Freakonomics-Revised-Expanded-Economist-Everything/dp/0061234001/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1309586280&amp;sr=8-1">Freakonomics</a>, skrevet av <a href="http://en.wikipedia.org/wiki/Steven_Levitt">Steven Levitt</a> og <a href="http://en.wikipedia.org/wiki/Stephen_J._Dubner">Stephen Dubner</a>. Jeg hadde h&oslash;rt lovord om boken, s&aring; jeg kj&oslash;pte den.</p>
<p>Tittelen p&aring; boken kan v&aelig;re noe misvisende, ettersom den ikke handler om &oslash;konomi slik man vanligvis tenker p&aring; faget: valutaer, bailouts, BNP og tilbud/ettersp&oslash;rsel. I stedet tar den opp mer jordn&aelig;re temaer (ordvalget er diskuterbart): f&oslash;rstekapitlet heter "what do schoolteachers and sumo wrestlers have in common?" (se nederst i bloggposten om du ikke liker spoilere) Kapitteltitlene gir en rimelig klar indikasjon p&aring; hva boken handler om (&aring; liste kapitteltitlene vil ogs&aring; spare meg for noen ord):</p>
<ol>
<li>What do schoolteachers and sumo wrestlers have in common?</li>
<li>How is the Ku Klux Klan like a group of real estate agents?</li>
<li>Why do drug dealers still live with their moms?</li>
<li> Where have all the criminals gone?</li>
<li>What makes a perfect parent?</li>
<li>Perfect parenting, part II</li>
</ol>
<p>Boken tar opp disse problemene med en &oslash;konoms &oslash;yne. Man antar at mennesker handler ut fra insentiver og egeninteresser, og vi ser p&aring; statistikk. Legalisering av abort f&oslash;rer til mindre kriminalitetet, svarte gir helt andre navn til sine barn enn hvite, &aring; selge narkotika er ikke l&oslash;nnsomt.</p>
<p>La deg ikke skremme av tittelen. Boken inneholder ingen utregninger, men er spekket av underholdende statistikk og enda morsommere argumentasjon (som sannsynligvis er riktig!). Anbefales. Den har ogs&aring; en oppf&oslash;lger, <a href="http://www.amazon.com/SuperFreakonomics-Cooling-Patriotic-Prostitutes-Insurance/dp/0060889586/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1309586968&amp;sr=1-1">Superfreakonomics</a>, som jeg kommer til &aring; lese etterhvert.</p>
<p>(Sumobrytere og l&aelig;rere jukser begge p&aring; resultater. )</p>
