---
layout: post
status: publish
published: true
title: '"I, robot" av Isaac Asimov'
author:
  display_name: fredrikmeyer
  login: fredrikmeyer
  email: hrmeyer@gmail.com
  url: ''
author_login: fredrikmeyer
author_email: hrmeyer@gmail.com
wordpress_id: 96
wordpress_url: http://fredrikmeyer.net/?p=96
date: '2011-01-13 21:27:55 +0100'
date_gmt: '2011-01-13 20:27:55 +0100'
categories:
- Ukategorisert
tags: []
comments: []
---
<p><a href="http://sphere.fredrikmeyer.net/wp-content/uploads/6a00d83451ccbc69e2010536198df6970c-400wi.jpg"><img class="alignright size-medium wp-image-496" title="I, robot" src="http://sphere.fredrikmeyer.net/wp-content/uploads/6a00d83451ccbc69e2010536198df6970c-400wi-205x300.jpg" alt="" width="205" height="300" /></a>Jeg har nylig lest boken "<a href="http://en.wikipedia.org/wiki/I,_Robot">I, robot</a>" av <a href="http://en.wikipedia.org/wiki/Isaac_Asimov">Isaac Asimov</a>. Den har ligget over et &aring;r i bokhyllen, men det var f&oslash;rst nylig den slapp ut. Jeg trengte noe &aring; lese i juleferien, og jeg ga - nesten for f&oslash;rste gang - en science fiction-bok sjansen. Heldigvis kan jeg n&aring; varmt anbefale boken.<!--more--></p>
<p>Jeg s&aring; <a href="http://en.wikipedia.org/wiki/I,_Robot_(film)">filmen</a> som visstnok er basert p&aring; boken for noen &aring;r siden, og det f&oslash;rste jeg m&aring; si er at novellene i boken ikke p&aring; noen m&aring;te minner om filmen. De har roboter til felles, og et par av de samme hovedpersonene. Ikke noe mer.</p>
<p>Boken er skrevet, som nevnt, av <a href="http://en.wikipedia.org/wiki/Isaac_Asimov">Isaac Asimov</a>, visstnok en av de store n&aring;r det kommer til science fiction. Han skrev sv&aelig;rt mye i l&oslash;pet av livet - faktisk s&aring; mye at han er en av dem som har skrevet mest noensinne. I f&oslash;lge Wikipedia skrev han over 500 b&oslash;ker, og 9000 brev og postkort.</p>
<p>"I, robot" kan egentlig vanskelig kalles en bok - det er mer en novellesamling best&aring;ende av sammenhengende noveller. Vi befinner oss i framtiden, og menneskeheten har utviklet en ny type robot, n&aring; med s&aring;kalte "positronic brains", roboter som kan tenke. Ved lov bygges alle positroniske robot med <a href="http://en.wikipedia.org/wiki/Three_Laws_of_Robotics">tre innebygde lover</a>:</p>
<ol>
<li>En robot f&aring;r ikke skade et menneske, eller ved passivitet la et menneske komme til skade.</li>
<li>En robot m&aring; adlyde ordrer fra mennesker med mindre dette bryter med regel 1.</li>
<li>En robot m&aring; beskytte sin egen eksistens s&aring; lenge dette ikke bryter med regel 1 og 2.</li>
</ol>
<p>Novellene i boken utforsker konsekvensene disse lovene har p&aring; tenkende roboter. I flere av historiene kommer vi over en robot som oppf&oslash;rer seg pussig, s&aring; er det opp til hovedpersonene &aring; finne ut hvorfor denne gj&oslash;r slik og slik - og dette forklares ut i fra de tre lovene.</p>
<p>En robot kan for eksempel begynne &aring; <a href="http://en.wikipedia.org/wiki/Liar!">lyve</a> siden han skj&oslash;nner at sannheten vil gj&oslash;re menneskene triste (og dermed "skade" dem). Eller hva om vi lar noen <a href="http://en.wikipedia.org/wiki/The_Evitable_Conflict">tenkende supermaskiner</a> styre verdens&oslash;konomien?</p>
<p><a href="http://en.wikipedia.org/wiki/I,_Robot">Wikipedia-siden</a> om boken har all den informasjon som trengs om bokens innhold.</p>
<p>Det som er morsomt med boken er hvordan robotenes oppf&oslash;rsel s&aring; ofte ble forklart utfra de tre lovene. Matematikeren i meg gliser stort n&aring;r slikt skjer, for dette blir nesten aksiomatisk. Akkurat som hele gruppeteorien utspringer fra noen f&aring; enkle aksiomer, utspringer ogs&aring; all oppf&oslash;rselen til roboter fra noen enkle regler.</p>
<p>Jeg regner med boken vil v&aelig;re morsom lesning for enhver person som liker logisk tenking.</p>
<p><a href="http://sphere.fredrikmeyer.net/wp-content/uploads/asimov.jpg"><img class="alignright size-medium wp-image-498" title="asimov" src="http://sphere.fredrikmeyer.net/wp-content/uploads/asimov-225x300.jpg" alt="" width="225" height="300" /></a>For&oslash;vrig: skrivestilen hans passer nok ogs&aring; meg. Han skriver veldig kort og konsist, og har f&aring;tt kritikk for dette. &nbsp;Karakterene i b&oslash;kene hans er sjeldent spesielt dype, og landskap osv blir sjeldent beskrevet n&oslash;ye.</p>
<blockquote><p>I made up my mind long ago to follow one cardinal rule in all my writing&mdash;to be clear. I have given up all thought of writing poetically or symbolically or experimentally, or in any of the other modes that might (if I were good enough) get me a Pulitzer prize. I would write merely clearly and in this way establish a warm relationship between myself and my readers, and the professional critics&mdash;Well, they can do whatever they wish.</p></blockquote>
