---
layout: post
status: publish
published: true
title: Travle tanker fra et mett land
author:
  display_name: FredrikMeyer
  login: FredrikMeyer
  email: hrmeyer@gmail.com
  url: ''
author_login: FredrikMeyer
author_email: hrmeyer@gmail.com
wordpress_id: 445
wordpress_url: http://sphere.fredrikmeyer.net/?p=445
date: '2011-01-30 21:05:24 +0100'
date_gmt: '2011-01-31 03:05:24 +0100'
categories:
- personlig
- USA-tur
tags: []
comments:
- id: 350
  author: Frihet
  author_email: frihet@frihet.org
  author_url: http://www.frihet.org/
  date: '2011-01-31 09:37:18 +0100'
  date_gmt: '2011-01-31 15:37:18 +0100'
  content: "Som alltid spennende &aring; lese om hvordan du har det.  Ser at du begynner
    &aring; miste grepet om det norske spr&aring;k, og hvis l&aelig;ringen av engelsk
    er omvendt proporsjonalt med dette, s&aring; lover det vel godt for den engelsktalende
    Fredrik.\r\n\r\nHer hjemme p&aring; berget snakker vi fortsatt om \"innvendingen\"
    (og ikke \"innvendelsen\"), og man blir \"veldig mett\" fremfor \"mye mett\".\r\n\r\nEr
    jeg slem med deg n&aring;?  H&aring;per du ikke slutter &aring; skrive av den
    grunn, for jeg setter veldig stor pris p&aring; reisebrevene dine.  Du l&aelig;rer
    deg nok norsk igjen n&aring;r du kommer tilbake til gamlelandet :)"
- id: 352
  author: Nikolai
  author_email: kolja1988@gmail.com
  author_url: http://nikolaissuperpop.blogspot.com/
  date: '2011-01-31 14:28:24 +0100'
  date_gmt: '2011-01-31 20:28:24 +0100'
  content: "Liker ikke det med at man b&oslash;r m&oslash;te opp til hver eneste forelesning.
    Mer og mer av obligatorisk oppm&oslash;te i Norge ogs&aring;, har jeg inntrykk
    av. Gj&oslash;r det mindre lett &aring; legge opp sin egen hverdag. Kanskje det
    er annerledes i realfag, men ser virkelig ikke den akutte faren ved ikke &aring;
    m&oslash;te opp i en forelesning i et humanistisk fag, selv om jeg likevel gj&oslash;r
    det. Men fint &aring; ha privilegiet &aring; kunne la v&aelig;re om det er hensiktsmessig.
    \r\n\r\nFin blogg ellers. Egentlig er det morsommere &aring; lese om dette enn
    politikk. =S"
- id: 353
  author: S&oslash;s
  author_email: theresesem@gmail.com
  author_url: ''
  date: '2011-01-31 15:13:35 +0100'
  date_gmt: '2011-01-31 21:13:35 +0100'
  content: "H&oslash;res herlig ut med mye og billig mat! Merker du noe s&aelig;rlig
    til kristendommen?\r\n\r\nMitt spr&aring;k ble varig skadet etter Australia. F&aring;r
    fortsatt h&oslash;re at jeg gj&oslash;r sterke verb om til svake, og diverse andre
    ting. S&aring; vi f&aring;r h&aring;pe du kommer helskinnet fra det."
- id: 354
  author: FredrikMeyer
  author_email: hrmeyer@gmail.com
  author_url: ''
  date: '2011-01-31 16:27:28 +0100'
  date_gmt: '2011-01-31 22:27:28 +0100'
  content: Regner med at hvis du g&aring;r tilbake til eldre bloggposter, s&aring;
    finner du sikkert like mange slurvefeil. (forh&aring;pentligvis) :)
- id: 355
  author: FredrikMeyer
  author_email: hrmeyer@gmail.com
  author_url: ''
  date: '2011-01-31 16:37:17 +0100'
  date_gmt: '2011-01-31 22:37:17 +0100'
  content: Kristendommen ser jeg over alt :P Det kryr av kirker p&aring; campus. G&aring;r
    sikkert forbi tre-fire stykker bare p&aring; vei til mattebygget (10 min g&aring;tur).
    (det er jo s&aring; mange forskjellige meningheter heromkring).
- id: 357
  author: Victoria M
  author_email: vickymey@msn.com
  author_url: http://victoriamm.blogg.no
  date: '2011-02-04 23:06:49 +0100'
  date_gmt: '2011-02-05 05:06:49 +0100'
  content: "Hei, Fredrik! N&aring; er det utrolig lenge siden sist. Jeg ser at du
    er p&aring; af&aelig;re i utenlandet, og jeg h&aring;per du har det fint. Samtidig
    m&aring; jeg ikke glemme &aring; tilf&oslash;ye at du skriver bra! Interessant
    &aring; lese innleggene dine.\r\nHilsen Victoria, s&oslash;skenbarn."
- id: 358
  author: FredrikMeyer
  author_email: hrmeyer@gmail.com
  author_url: ''
  date: '2011-02-04 23:18:13 +0100'
  date_gmt: '2011-02-05 05:18:13 +0100'
  content: Oj, det var lenge siden! Tittet p&aring; bloggen din, og abbonnerer n&aring;
    p&aring; innleggene. Du tar veldig fine bilder :) Burde jo komme p&aring; bes&oslash;k
    neste gang jeg er i Bod&oslash; =)
---
<p><a title="Squirrels by FredrikMeyer, on Flickr" href="http://www.flickr.com/photos/fredrikmeyer/5402738171/"><img class="alignright" src="http://farm6.static.flickr.com/5217/5402738171_c330043c70_m.jpg" alt="Squirrels" width="240" height="160" /></a>Som tittelen p&aring; bloggposten hinter til, er det mye mat her. Jeg har "mat-abbonement" p&aring; 10 m&aring;ltider i uken p&aring; <a href="http://www.housing.illinois.edu/Current/Dining/Locations%20and%20Hours/Classic/Ike.aspx">spisesalen</a> like ved, og jeg s&oslash;rger alltid for &aring; spise nok til at jeg slipper &aring; kj&oslash;pe mat i s&aelig;rlig grad senere p&aring; dagen (en venn poengterte at det kan f&aring; f&oslash;lger for min apetitt framover, ogs&aring; i Norge. Jeg m&aring; tenke over den innvendelsen). Der er det iskremmaskin, <em>waffle</em>-maskin, brusmaskin, kyllingfileer, pizza, salater, kaffe, kaker, ... Til frokost tar jeg ofte <em>scrambled eggs</em>, sammen med pannekaker med sirup p&aring;. Og en del salater. Kanskje en vaffelkake i tillegg. Til frokost velger jeg som regel appelsinjus, men Cola Light er alltid fristende. Kort sagt: jeg blir mye mett.<!--more--></p>
<p>N&aring;r det kommer til studiene, er det veldig mye &aring; gj&oslash;re, spesielt i ett kurs (ironisk nok er dette det eneste <a href="http://www.math.uiuc.edu/~schenck/M505S11.html">kurset</a> som kun er ca. 5 studiepoeng). I ukedagene leser jeg som regel til &aring;tte-ni-tiden (riktignok sover jeg til &aring;tte :P). De andre kursene krever ogs&aring; sitt, og det er uvant for en norsk student &aring; ha innleveringer hver uke. Og spesielt at det forventes at jeg dukker opp p&aring; hver eneste forelesning.</p>
<p>N&aring;r det kommer til pensum og oversikt m&aring; det innr&oslash;mmes at jeg har bedre erfaring fra <a href="http://www.uio.no/">Universitet i Oslo</a>. Pensumb&oslash;kene her f&oslash;lges ofte ikke, eller f&oslash;lges veldig selektivt, og det viktigste er egentlig forelesningsnotatene. I tillegg er det ikke noen fast undervisningsplan i noen av kursene, noe som gj&oslash;r det vanskeligere &aring; forberede seg til forelesningene. Det er ogs&aring; mye st&oslash;rre forskjell p&aring; undergrad/grad-kurs enn det er i Norge (bachelor/master-kurs). Grad-kursene har betydelig h&oslash;yere niv&aring; enn undergrad-kursene, og inneholder faktisk beviser. De to undergrad-kursene jeg tar (<a href="http://www.math.uiuc.edu/~kapovich/481-11/481-11.html">vektoranalyse</a> og <a href="http://www.math.uiuc.edu/~clein/m428_s11.html">knuteteori</a>) er veldig informative, og bevisene (der de forekommer) er heller overfladiske. P&aring; den annen side er homologi-kurset s&aring; krevene at det tar 80% av studietiden min (heldigvis slutter sistnevnte kurs allerede i mars).</p>
<p><a href="http://sphere.fredrikmeyer.net/wp-content/uploads/jan2011-002e.jpg"><img class="alignright size-medium wp-image-447" title="Lundgren Hall" src="http://sphere.fredrikmeyer.net/wp-content/uploads/jan2011-002e-300x200.jpg" alt="" width="300" height="200" /></a>Bildet til h&oslash;yre er bygningen jeg bor i. Jeg bor i det vi p&aring; norsk vil kalle andre-etasjen. Usikker p&aring; hvilket vindu som tilh&oslash;rer meg. Antakelig nummer tre eller fire p&aring; langsiden av bygningen.</p>
<p><a href="http://sphere.fredrikmeyer.net/wp-content/uploads/jan2011-018e.jpg"><img class="alignright size-medium wp-image-448" title="Espresso Royale" src="http://sphere.fredrikmeyer.net/wp-content/uploads/jan2011-018e-300x231.jpg" alt="" width="300" height="231" /></a>Det andre bildet er en kaffebar jeg ofte har sittet og lest p&aring;. Liker den veldig godt - kaffen er god, og det er mange som leser der; f&oslash;lgelig er det stille nok til at jeg kan gj&oslash;re det samme (og er det ikke det vi har kaffebarer til?)</p>
<p>Sjekk forresten ut dette bildet jeg har tatt: (<a href="http://www.flickr.com/photos/fredrikmeyer/5402738171/"><em>FLICKR</em></a>)</p>
<p><strong>Edit</strong>: Glemte &aring; nevne at jeg p&aring; torsdag stod p&aring; stand og representerte Norge. Det var "utvekslings-opplysning", og hver verdensdel hadde sine representanter. Jeg valgte &aring; stille opp for &aring; representere Norge. Var faktisk 4-5 stykker som spesifikt &oslash;nsket &aring; studere i Norge. <strong>Jeg fikk ogs&aring; h&oslash;re at jeg antakelig var den f&oslash;rste norske studenten ever til dette universitet.</strong></p>
