---
layout: post
status: publish
published: true
title: Oppsummering av &aring;ret 2010
author:
  display_name: FredrikMeyer
  login: FredrikMeyer
  email: hrmeyer@gmail.com
  url: ''
author_login: FredrikMeyer
author_email: hrmeyer@gmail.com
wordpress_id: 359
wordpress_url: http://sphere.fredrikmeyer.net/?p=359
date: '2011-01-02 01:53:43 +0100'
date_gmt: '2011-01-02 01:53:43 +0100'
categories:
- personlig
tags: []
comments:
- id: 337
  author: Daniel
  author_email: aleksandersen@runbox.no
  author_url: http://my.opera.com/daniel/blog/
  date: '2011-01-06 23:08:56 +0100'
  date_gmt: '2011-01-06 23:08:56 +0100'
  content: Dette var alt for mye tekst, gutt. Du m&aring; strukturere tekstene dine
    litt bedre. Ta det viktigste f&oslash;rst og deretter legge til &lsaquo;padding&rsaquo;
    med mindre viktige elementer senere i teksten. Dette er norsk p&aring; videreg&aring;ende.
---
<p><a href="http://bloggurat.net/minblogg/registrere/b1505c424df99a41a9d5d886f566f9f151d8c5be">&Aring;</a>ret 2010 har v&aelig;rt et <strong>fint</strong> &aring;r. Jeg har f&aring;tt drive mye med det jeg liker aller mest &aring; drive med - nemlig matematikk. B&aring;de h&oslash;sten og v&aring;rsemesteret har v&aelig;rt oppv&aring;kninger for meg matematisk. V&aring;ren tok jeg <a href="http://www.uio.no/studier/emner/matnat/math/MAT2200/">introduksjonskurset</a> i grupper, ringer og kropper. Det var virkelig noe nytt matematisk. N&aring; er det ikke lenger tall vi arbeider med, men abstrakte strukturer. Matematikk var plutselig mye mer enn sm&aring; st&oslash;rrelser og epsiloner og deltaer. S&aring; tok jeg ogs&aring; det vanskeligste kurset jeg noensinne har tatt. <a href="http://www.uio.no/studier/emner/matnat/math/MAT2400/">Reell analyse</a> (med <a href="http://www.amazon.com/Companion-Analysis-Graduate-Studies-Mathematics/dp/0821834479">K&ouml;rners bok</a>). Faget var en virkelig bitch - men jeg l&aelig;rte virkelig mye ogs&aring;. Dessverre var det meste av kunnskapen modningskunnskap.<!--more--> I tillegg hadde jeg mitt f&oslash;rste virkelige "arbeid" i matematikk med faget <a href="http://www.uio.no/studier/emner/matnat/math/MAT2000/">MAT2000 </a>- Prosjektarbeid i matematikk. Et halvveis selvvalgt tema (man fikk velge mellom en hel del alternativer) som vi skulle skrive om. Jeg valgte &aring; skrive om <a href="http://fredrikmeyer.net/div/BanachTarski.pdf">Banach-Tarski-paradokset</a>, og ogs&aring; der l&aelig;rte jeg virkelig mye. Jeg l&aelig;rte mye om hvordan man skriver matematikk p&aring; egen h&aring;nd, hvordan man utnytter en veileder, og jeg ble dyktigere i LaTeX. Det var en utrolig deilig f&oslash;lelse &aring; framf&oslash;re prosjektarbeidet mitt for to professorer i matematikk som begge fulgte interesserte med.</p>
<p>V&aring;ren var jeg ogs&aring; med i forskningsprosjekt. I ni-ti uker fikk jeg <a href="http://en.wikipedia.org/wiki/Vitamin_K">K-vitamintabletter</a> (eller kanskje placebo... hvem vet?), og ble tatt blodpr&oslash;ve av. Det var en interessant opplevelse, og ikke minst ble jeg litt mindre redd for spr&oslash;yter. Som takk for motet fikk jeg en mindre godtgj&oslash;relse (omtrent tilsvarende 8 timers arbeid). Men! Som alle er klare over, er ikke penger meningen med livet - they're just a means to an end!</p>
<p>Sommeren dette &aring;ret er nok det jeg kommer til &aring; huske aller best. Min gode venn og reisekamerat <a href="http://www.frihet.org/">Thomas</a> mener at minner er noe av det viktigste i livet. Jeg verdsetter dog f&oslash;lelsen av dypere forst&aring;else, og det er ikke noe man opplever "i &oslash;yeblikket" - det er noe man tilegner seg over tid. Kanskje har han rett. Uansett, sommeren var fantastisk. Jeg og han dro til Thailand og Singapore sammen. Vi sl&aring;ss med b&oslash;lgene i <a href="http://www.google.com/images?client=opera&amp;rls=nb&amp;q=patong&amp;oe=utf-8&amp;um=1&amp;ie=UTF-8&amp;source=og&amp;sa=N&amp;hl=no&amp;tab=wi&amp;biw=1246&amp;bih=639">Patong</a>, brente av oss huden p&aring; skuldrene, ble massert p&aring; f&oslash;ttene av sultne sm&aring;fisk, og spiste mye god mat. Vi leste mange gode b&oslash;ker, og kj&oslash;pte enda flere. Ogs&aring; Singapore var fantastisk. Hele landet var en enorm demonstrasjon i orden og vakker arkitektur. Dit vil jeg dra igjen. (det som trekker ned er selvsagt "noe" mangel p&aring; ytringsfrihet og det vi vil kalle "vanlige borgerrettigheter"). Noe av det morsomste var &aring; hoppe 20 meter i strikk.</p>
<p>S&aring; kom h&oslash;sten. Nok et modningssemester matematisk sett. Jeg har l&aelig;rt utrolig mye matematikk - og det er utrolig morsomt &aring; observere sin egen l&aelig;ring. Problemer jeg m&aring;tte tenke lenge p&aring; tidligere l&oslash;ser jeg n&aring; mye raskere, og jeg f&oslash;ler nesten at jeg er kommet forbi det "rigor&oslash;se" <a href="http://terrytao.wordpress.com/career-advice/there&rsquo;s-more-to-mathematics-than-rigour-and-proofs/">stadiet</a> i matematikkdannelsen.</p>
<p>Jeg pr&oslash;vde meg for f&oslash;rste gang p&aring; et fysikkfag (<a href="http://www.uio.no/studier/emner/matnat/fys/FYS1120/">FYS1120</a> - Elektromagnetisme), og angrer hardt p&aring; det. Faget var greit nok - undervisningen var h&aring;pl&oslash;s, og framgangsm&aring;tene var absolutt ikke noe for meg. &nbsp;Obligene handlet lite om forst&aring;else, men om programmering og griseregning. Man kunne forst&aring; begrepene, men gj&oslash;re det d&aring;rlig p&aring; grunn av all tiden som ble brukt til &aring; griseregne og &aring; ny-l&aelig;re programmering. Halvveis ut i semesteret droppet jeg faget, en erfaring rikere. Aldri igjen ta fysikkfag. Aldri igjen ta fag du ikke er helt sikker du kommer til &aring; like. Og jeg vet mer hva jeg liker: jeg liker rigor&oslash;s deduksjon, abstrakte begreper, eleganse, mind-food. Noe virkelig &aring; tygge p&aring;.</p>
<p>I tillegg hadde jeg blitt overtalt av min venn til &aring; ta et introduksjonskurs i mikro&oslash;konomi, <a href="http://www.uio.no/studier/emner/sv/oekonomi/ECON1210/">ECON1210</a>. Det var en blandet opplevelse. Jeg l&aelig;rte mye om &oslash;konomisk tankegang, om marginalkostnader og om rasjonelle vurderinger. Jeg savnet en mer matematisk tiln&aelig;rming - tiln&aelig;rmingen her var veldig overfladisk og "med ord". Mange ord. Altfor mange ord. <a href="http://www.amazon.com/Microeconomics-B-Douglas-Bernheim/dp/007290027X">Boken</a> var p&aring; 700 sider n&aring;r det samme kunne v&aelig;rt skrevet p&aring; 100. Eksamen gikk greit. Helt greit. En erfaring rikere, og litt mer kunnskap. Jeg liker matte. (men ogs&aring; &oslash;konomi :-) dog helst p&aring; fritiden)</p>
<p>Jeg tok introduksjonskurset i topologi, <a href="http://www.uio.no/studier/emner/matnat/math/MAT3500/">MAT3500</a>/4500 (klonet fag). Veldig l&aelig;rerikt, selv om faget til tider kunne v&aelig;re litt vel teknisk. Det var et lite sammensurium av definisjoner og mengdel&aelig;re. Vi hadde verdens beste robot av en <a href="http://folk.uio.no/rognes/">foreleser</a>: utrolig dyktig. Aldri en feil, ordentlig forarbeid (<a href="http://folk.uio.no/rognes/kurs/mat4500h10/topology.pdf">100 sider</a> notater i PDF-format!). I tillegg fikk vi en virkelig morsom eksamen - jeg koste meg gjennom den. (venter enn&aring; p&aring; resultatet)</p>
<p>Men det store - virkelig l&aelig;rerike - kurset dette &aring;ret var kommutativ algebra, <a href="http://www.uio.no/studier/emner/matnat/math/MAT4200/h10/">MAT4200</a>. &nbsp;<a href="http://www.amazon.com/Introduction-Commutative-Algebra-Michael-Atiyah/dp/0201407515">Pensumboken</a> var p&aring; tette 120 sider - de vanskeligste 120 sidene jeg noensinne har satt mine &oslash;yner p&aring;. Men det var en fryd &aring; ta faget. En slik eleganse, en slik korthet, og dype resultater. Dette var virkelig matematikk. Enkle aksiomer, utforske konsekvenser, trylle litt med <a href="http://en.wikipedia.org/wiki/Zorn's_lemma">Zorn's lemma</a>. Foreleseren fortjener ogs&aring; skryt. Han lot oss levere inn frivillige innleveringer med tilbakemeldinger og mye tid ble brukt etter forelesningene med fagprat - b&aring;de relevant og irrelevant. I tillegg endte jeg opp med en A.</p>
<p>I desember har det skjedd litt av hvert =)</p>
<p>Ny&aring;ret blir nok mer hendelsesrikt. Jeg skal utveksle til USA - til University of Illinois at Urbana-Champaign (<a href="http://illinois.edu/">UIUC</a>) for v&aring;rsemesteret. Selv om det er en liten sjanse n&aring; for at jeg ikke f&aring;r ta alle de kursene jeg &oslash;nsker (de kan v&aelig;re forbeholdt masterstudenter), blir nok dette et l&aelig;rerikt halv&aring;r. Ikke bare matematisk, men nok ogs&aring; kulturelt og sosialt.</p>
<p>Jeg kommer til &aring; forn&aelig;rme mange med manglende amerikansk h&oslash;flighet. I Norge gir vi ofte ikke tips p&aring; restaurant, vi bruker ikke "mister", "ma'am", eller andre un&oslash;dvendige h&oslash;flighetsfraser. Eller begynner &aring; snakke med ukjente p&aring; butikken for &aring; f&aring; tiden til &aring; g&aring;. S&aring; er jeg spent p&aring; hvor mange som faktisk vet hvor Norge ligger. Og p&aring; hvordan det blir &aring; dele dorm room med en fremmed student.</p>
<p>&Aring;rets nytt&aring;rsforsett: mindre F5 og un&oslash;dvendige tidsbruk. Vi lever bare en gang, og livet skal nytes.</p>
