---
layout: post
status: publish
published: true
title: '"River Out of Eden" - Richard Dawkins'
author:
  display_name: FredrikMeyer
  login: FredrikMeyer
  email: hrmeyer@gmail.com
  url: ''
author_login: FredrikMeyer
author_email: hrmeyer@gmail.com
wordpress_id: 409
wordpress_url: http://sphere.fredrikmeyer.net/?p=409
date: '2011-01-16 02:08:13 +0100'
date_gmt: '2011-01-16 02:08:13 +0100'
categories:
- anmeldelser
tags: []
comments: []
---
<p><a href="http://sphere.fredrikmeyer.net/wp-content/uploads/riveroutofeden.jpeg"><img class="alignright size-medium wp-image-410" title="River Out of Eden" src="http://sphere.fredrikmeyer.net/wp-content/uploads/riveroutofeden-195x300.jpg" alt="" width="195" height="300" /></a>Siden jeg har f&aring;tt for vane &aring; skrive om alle b&oslash;kene jeg leser, nevner jeg raskt n&aring; at jeg nettopp har fullf&oslash;rt "River Out of Eden" av Richard Dawkins. Fritt oversatt fra baksiden av boken:<!--more--></p>
<blockquote><p>[...] Dawkins gir en levende [...] framstilling av evolusjon. Han bruker metaforen om en elv som en str&oslash;m av informasjon ved hjelp av DNA til &aring; argumentere for at arter oppst&aring;r gradvis, ved evolusjon, heller enn &aring; bli skapt av Gud.</p></blockquote>
<p>Som alle b&oslash;kene jeg har lest av Dawkins, er denne b&aring;de interessant, morsom og velskrevet. Interessant, fordi den forteller om alle de pussige og spesielle m&aring;tene levende liv har tilpasset seg og hvordan det pr&oslash;ver &aring; overleve. Han forklarer hvordan en del av verden fungerer, og det er slikt jeg liker &aring; lese.</p>
<p>N&aring;r det er sagt, m&aring; det sies at jeg oppfatter boken som litt lite original. De to andre b&oslash;kene jeg har lest av ham ("The God Delusion" og "The Greatest Show on Earth") hadde begge et hovedbudskap, og var jevnt over bedre skrevet. Riktignok er de nevnte b&oslash;kene nyere. Det er egentlig kun f&oslash;rste kapittel i boken som har noe med tittelen &aring; gj&oslash;re. Resten er en leksjon i evolusjon, og forskjellige mekanismer bak dette.</p>
<p>Uansett - er man interessert i biologi, er dette interessant lesning.</p>
