---
layout: post
status: publish
published: true
title: '"hva er MATEMATIKK" av Liza Lorentzen'
author:
  display_name: FredrikMeyer
  login: FredrikMeyer
  email: hrmeyer@gmail.com
  url: ''
author_login: FredrikMeyer
author_email: hrmeyer@gmail.com
wordpress_id: 230
wordpress_url: http://cube.fredrikmeyer.net/?p=230
date: '2012-12-19 19:58:01 +0100'
date_gmt: '2012-12-19 18:58:01 +0100'
categories:
- Anmeldelser
tags: []
comments: []
---
<p><a href="http://cube.fredrikmeyer.net/?attachment_id=231" rel="attachment wp-att-231"><img class="alignright size-medium wp-image-231" alt="Hva er matematikk?" src="http://cube.fredrikmeyer.net/wp-content/uploads/Hva_er_matematikk_-de_5039c-229x300.jpg" width="229" height="300" /></a>Boken "<a href="http://www.universitetsforlaget.no/boker/hva_er/katalog?productId=67705753">hva er MATEMATIKK</a>" av professor i matematikk ved NTNU, <a href="http://www.math.ntnu.no/~lisa/">Lisa Lorentzen</a>, kom ut i november. Den er en del av <a href="http://www.universitetsforlaget.no/">Universitetsforlagets</a> <a href="http://www.universitetsforlaget.no/boker/hva_er/">"hva er"-serie</a>. Jeg fullf&oslash;rte nylig boken.</p>
<p>Boken er ment for folk flest, og det er meningen at hvem som helst skal kunne lese boken uten &aring; g&aring; glipp av noe. &nbsp;Boken har syv kapitler, hvor de seks siste begynner med "matematikk og ...": tall, verden, struktur, sannhet, uendeligheten og skj&oslash;nnhet.</p>
<p>M&aring;let med boken er ikke &aring; gi noe hurtigkurs i matematikk eller &aring; v&aelig;re noe "survival kit" gjennom Kalkulus-kurset. Den pr&oslash;ver, tvert om, &aring; beskrive hva matematikk er gjennom &aring; appellere til hva en matematiker gj&oslash;r og hva som er s&aring; fascinerende med matematikk. Nettopp p&aring; siste punktet skinner forfatterens egen fascinasjon gjennom. Matematikk er utrolig fascinerende, og har man ikke allerede denne fascinasjonen, smitter den over fra Lorentzens engasjerte beskrivelser.</p>
<p>P&aring; enkelte steder virker hun s&aring; fascinert at det nesten virker kunstig - men man skal ikke klage s&aring; mye over overdreven fascinasjon for matematikk! Slikt finner man ikke over alt.</p>
<p>Hun tar blant annet opp M&ouml;bius-b&aring;ndet, at [latex]\sqrt{2}[/latex] er irrasjonal, Koch-sn&oslash;flak, fraktaler, matriser, matematiske modeller, uendelighet, tesseleringer av planet, Euler-karakteritistikk, med mer.</p>
<p>Boken er lettlest (kan hende enkelte deler ikke er kjempelettlest om man ikke er vant til &aring; lese tung matte) - fin sengelesing/trikkelesestoff.</p>
