---
layout: post
status: publish
published: true
title: Steve Jobs-biografien av Walter Isaacson
author: Fredrik Meyer
author_login: fredrikmeyer
author_email: hrmeyer@gmail.com
wordpress_id: 98
wordpress_url: http://fredrikmeyer.net/?p=98
date: '2012-01-14 21:32:00 +0100'
date_gmt: '2012-01-14 20:32:00 +0100'
categories:
- Anmeldelser
tags: []
comments: []
---
<p><a href="http://sphere.fredrikmeyer.net/wp-content/uploads/steve-jobs1.jpg"><img style="float:right" class="alignright size-medium wp-image-538" title="Steve Jobs" src="http://sphere.fredrikmeyer.net/wp-content/uploads/steve-jobs1-239x300.jpg" alt="" width="239" height="300" /></a>I juleferien begynte jeg &aring; lese p&aring; Walter Isaacsons <a href="http://www.amazon.com/Steve-Jobs-Walter-Isaacson/dp/1451648537/ref=sr_1_1?ie=UTF8&amp;qid=1326566790&amp;sr=8-1">Steve Jobs-biografi</a>. Jeg har ikke lest mange biografier tidligere (tallet kan avrundes til noe veldig lavt), og da spesielt ikke noen p&aring; over 600 sider.</p>

<p>2011 var &aring;ret da jeg ble Apple-<a href="http://vimeo.com/30619793">fanboy</a>. I mars kj&oslash;pte jeg <a href="http://en.wikipedia.org/wiki/IPad">iPad</a>, og jeg har gjentatte ganger etterp&aring; p&aring;st&aring;tt at den har v&aelig;rt mitt beste kj&oslash;p noensinne. &nbsp;Jeg har lest veldig mange b&oslash;ker med <a href="http://itunes.apple.com/us/app/id302584613?mt=8">Kindle</a>-appen, spilt <a href="http://itunes.apple.com/us/app/angry-birds/id343200656?mt=8">Angry Birds</a>, lest masse matematikk p&aring; PDF-filer, surfet og skrevet epost.</p>

<p>I sommer kj&oslash;pte jeg (riktignok en brukt) iPhone, og kort etterp&aring; en (brukt) MacBook Air. Begge er produkter jeg er utrolig forn&oslash;yd med, og man kan ikke annet enn &aring; v&aelig;re takknemlig for mannen som har gitt oss s&aring; mange gode produkter. Ogs&aring; produkter vi ikke visste vi hadde lyst p&aring; (Steve Jobs hatet markedsunders&oslash;kelser, for han mente folk ikke visste hva de ville ha).</p>

<p><a href="http://newth.net/eirik/2011/11/09/steve-jobs-hippie-kunstner-og-ekstreminnovator/">Mange</a> andre har skrevet om biografien, s&aring; jeg skal ikke utbrodere. Boken forteller om en mann som ikke bare er utrolig dedikert, men ogs&aring; har en noe spesiell personlighet. Vi blir kjent med hans "<a href="http://en.wikipedia.org/wiki/Reality_distortion_field">reality distortion field</a>" og hans bin&aelig;re syns p&aring; virkeligheten. Ting var enten "shit" eller "perfect". Microsoft-produkter var som regel "shit".</p>

<p>Her er noen sitater fra boken:</p>

<p>Steve var "alternativ" og trodde i stor grad p&aring; intuisjon som veien til godt design. Han kunne se p&aring; produktpr&oslash;ver, og uten &aring; begrunne hvorfor, utbryte "this is shit". Han verdsatte likevel rasjonell tankegang:</p>

<blockquote><p>Western rational thought is not an innate human characteristic; it is learned and is the great achievement of Western civilization.</p>
</blockquote>
  <figure style="width: 300px; float:right">
    <a href="http://sphere.fredrikmeyer.net/wp-content/uploads/steve-jobs-Steve-wozniak.jpg"><img class="size-medium wp-image-539" title="Steve Jobs og Steve Wozniak" src="http://sphere.fredrikmeyer.net/wp-content/uploads/steve-jobs-Steve-wozniak-300x218.jpg" alt="" width="300" height="218" /></a>
    <figcaption>Steve Jobs og Steve Wozniak. Wozniak var p&aring; mange m&aring;ter hovedingeni&oslash;ren bak Apple I og Apple II.</figcaption>
  </figure>
<p>Han hadde spesielle spisevaner, noe som muligens forkortet livet hans betraktelig da han ble behandlet for kreft. Siden han ikke hadde sine egen lever og deler av bukspyttkjertelen hans var operert bort, klarte ikke kroppen hans &aring; ta opp proteiner godt. Likevel insisterte han p&aring; &aring; leve i stor grad p&aring; frukt-smoothier, epler og andre strenge veganske dietter. Ved et tilfelle sa han til sin mor:</p>

<blockquote><p>&nbsp;I'm a fruitarian and I will only eat leaves picked by virgins in the moonlight.</p>
</blockquote>
<p>Denne trenger ikke forklaring:</p>

<blockquote><p>Sometimes, to relieve stress, he would soak his feet in the toilet, a practice that was not as soothing for his colleagues.</p>
</blockquote>
<p>Steve Jobs var utrolig opptatt av brukervennlighet og at produktene skulle v&aelig;re intuitive &aring; forst&aring; (hvem har vel ikke satt seg fast p&aring; en Windows-datamaskin i en eller annen bortgjemt meny?). En iPad-eier forteller om hva som skjedde da en 6-&aring;ring som (visstnok) aldri hadde sett en datamaskin f&oslash;r, fikk pr&oslash;ve en iPad:</p>

<blockquote><p>With no instruction, and never having seen a computer before, the boy started using it intuitively. He began swiping the screen, launching apps, playing a pinball game."Steve Jobs has designed a powerful computer that an illiterate six-year-old can use without instruction," Noer wrote. "If that isn't magical, I don't know what is."</p>
</blockquote>
<p>For ikke &aring; forgude denne (geniale) mannen for mye, her er et artig sitat:</p>

<blockquote><p>We believe we have a moral responsibility to keep porn off the iPhone.</p>
</blockquote>
<p>Dette siste sitatet eksemplifiserer veldig godt en del av Apples produktfilosofi: de vil kontrollere hele prosessen, fra fabrikkeringen til brukeropplevelsen. De vil ikke la iOS kj&oslash;re p&aring; andre mobiler, og ihvertfall ikke la deg &aring;pne telefonen/datamaskinen/iPadden. Det samme er tilfellet med applikasjoner: apper til iPad/iPhone m&aring; godkjennes av Apple f&oslash;r de legges ut p&aring; App Store, og de bannlyser for eksempel pornografisk materiale og politisk ladet materiale.</p>

<figure style="width: 300px; float:right">
  <a href="http://sphere.fredrikmeyer.net/wp-content/uploads/604px-Apple_logo_Think_Different_vectorized.svg_.png"><img style="float:right" class="size-medium wp-image-540" title="Apple-logoen" src="http://sphere.fredrikmeyer.net/wp-content/uploads/604px-Apple_logo_Think_Different_vectorized.svg_-300x189.png" alt="" width="300" height="189" /></a>
  <figcaption>"Think different" - men tenk ikke p&aring; porno!</figcaption>
</figure>
<p>Denne bruken av kontroll har den positive effekten at brukeropplevelsen blir enklere, mer intuitiv, og at applikasjonene p&aring; produktene fungerer bedre. Alle de som har pr&oslash;vd b&aring;de Windows og Mac-maskiner vet at det er mye mer venting og krasjing med Windows-maskiner. Til gjengjeld kan Windows kj&oslash;res p&aring; nesten alle maskiner, det er ingen restriksjoner p&aring; utvikling av programvare, og du kan faktisk &aring;pne maskinen (til og med bygge den selv!)</p>

<p>Det er likevel nettopp kontrollen og den lukkede modellen som har gjort Apple-produktene s&aring; gode som de er. En eller annen tulling kan ikke lage virus-infiserte apper til telefonen din, og du har ikke mulighet til &aring; &oslash;delegge datamaskinen din (ved for eksempel &aring; sette inn nytt minne).</p>

<p>Boken anbefales - spesielt for dem som tror de kan finne p&aring; &aring; like &aring; lese biografier. Det har jeg som nevnt ikke gjort mye av, og det frister. Kanskje blir neste biografi <a href="http://www.amazon.com/Einstein-Life-Universe-Walter-Isaacson/dp/0743264746/ref=pd_sim_b_2">Albert Einstein-biografien</a> av samme forfatter.</p>

