---
layout: post
status: publish
published: true
title: '"No Easy Day: The Firsthand Account of the Mission that Killed Osama bin Laden"'
author:
  display_name: fredrikmeyer
  login: fredrikmeyer
  email: hrmeyer@gmail.com
  url: ''
author_login: fredrikmeyer
author_email: hrmeyer@gmail.com
wordpress_id: 102
wordpress_url: http://fredrikmeyer.net/?p=102
date: '2012-09-29 21:36:25 +0200'
date_gmt: '2012-09-29 19:36:25 +0200'
categories:
- Anmeldelser
tags: []
comments: []
---
<p><a href="http://sphere.fredrikmeyer.net/wp-content/uploads/NoEasyDayCoverArt.jpg"><img class="alignright size-full wp-image-562" title="No Easy Day" src="http://sphere.fredrikmeyer.net/wp-content/uploads/NoEasyDayCoverArt.jpg" alt="" width="200" height="301" /></a>Jeg fullf&oslash;rte akkurat boken "<a href="http://www.amazon.com/No-Easy-Day-Firsthand-ebook/dp/B008MG1E4A/">No Easy Day: The Firsthand Account of the Mission that Killed Osama bin Laden</a>", <a href="http://en.wikipedia.org/wiki/No_Easy_Day">skrevet</a> av en mann med pseudonymet Mark Owen, en tidligere amerikansk spesialsoldat.</p>
<p>Boken tar for seg jeg-personens karriere som spesialsoldat. Han &nbsp;beskriver flere oppdrag, blant dette et hvor han er med p&aring; &aring; redde en amerikansk kaptein som <a href="http://en.wikipedia.org/wiki/Maersk_Alabama_hijacking">holdes som gissel av somaliske pirater</a>. Virkeligheten er brutal - piratene blir skutt av snipere s&aring; snart alle tre er synlig p&aring; samme tidspunkt. Et annet oppdrag som ble beskrevet foregikk i Irak. Da det viste seg at "de slemme" (i mangel av bedre ord) hadde barrikadert seg med sandsekker i huset de gjemte seg i, var l&oslash;sningen enkel: skyte ned hele bygget med tanks.</p>
<p>Omtrent halvveis ute i boken f&aring;r jeg-personen vite at han og flere andre er plukket ut til &aring; ta ut <a href="http://en.wikipedia.org/wiki/Osama_bin_Laden">Osama bin Laden</a>. Etter et blindspor fire &aring;r tidligere, tror de fleste at dette er nok et blindspor. CIA p&aring;st&aring;r de er "100% sikre". Planleggingen, treningen og utf&oslash;relsen av oppdraget beskrives grundig - og er vanvittig spennende &aring; lese om. <a href="http://en.wikipedia.org/wiki/Death_of_Osama_bin_Laden">bin Laden ble skutt</a> i det han tittet ut en d&oslash;r - han var ubev&aelig;pnet. Etterp&aring; ble han skutt flere ganger i overkroppen.</p>
<p>P&aring; visse m&aring;ter er boken brutal. Her er et par sitater:</p>
<blockquote><p>... That night, we killed more than ten fighters and suffered no casualties.</p></blockquote>
<p>og</p>
<blockquote><p>Abrar al-Kuwaiti was wounded and struggling on the floor. Just as they opened fire again, his wife Bushra jumped in the way to shield him. The second burst of rounds killed both of them.</p></blockquote>
<p>Det naive inntrykket mitt er at krig er overraskende brutalt, og at spesialsoldatene var meget bedre utrustet enn motstanderne (dette kommer veldig tydelig fram n&aring;r han beskriver nattbrillene sine: de skal ha kostet 65.000 dollar!)</p>
<p>Veldig spennede, veldig interessant. Anbefales absolutt. Les ogs&aring; de <a href="http://www.amazon.com/No-Easy-Day-Firsthand-ebook/product-reviews/B008MG1E4A/ref=cm_cr_dp_qt_hist_one?ie=UTF8&amp;filterBy=addOneStar&amp;showViewpoints=0">negative anmeldelsene</a> p&aring; Amazon for litt perspektiv. De er interessante, selv om jeg ikke helt kjenner meg igjen i all kritikken.</p>
