---
layout: post
status: publish
published: true
title: Alkymisten av Paulo Coelho
author:
  display_name: fredrikmeyer
  login: fredrikmeyer
  email: hrmeyer@gmail.com
  url: ''
author_login: fredrikmeyer
author_email: hrmeyer@gmail.com
wordpress_id: 100
wordpress_url: http://fredrikmeyer.net/?p=100
date: '2012-08-13 21:33:45 +0200'
date_gmt: '2012-08-13 19:33:45 +0200'
categories:
- Anmeldelser
tags: []
comments: []
---
<p>[caption id="attachment_554" align="alignright" width="216"]<a href="http://sphere.fredrikmeyer.net/wp-content/uploads/TheAlchemist.jpg"><img class="size-full wp-image-554" title="Alkemisten" src="http://sphere.fredrikmeyer.net/wp-content/uploads/TheAlchemist.jpg" alt="" width="216" height="351" /></a> F&oslash;rste omslag[/caption]</p>
<p>Jeg fullf&oslash;rte akkurat "<a href="http://no.wikipedia.org/wiki/Alkymisten">Alkymisten</a>" av <a href="http://no.wikipedia.org/wiki/Paulo_Coelho">Paulo Coelho</a>. Jeg har tidligere lest tre b&oslash;ker av samme forfatter, og alle disse har v&aelig;rt sv&aelig;rt gode b&oslash;ker. Spesielt likte jeg "Veronika vil d&oslash;".</p>
<p>Jeg har forandret meg de siste 5-6 &aring;rene. I ten&aring;rene var jeg fascinert av fantasy-litteratur og trollmenn og slikt. Jeg elsket Isabel Allendes "&Aring;ndenes Hus", for eksempel. Etterhvert ble jeg mer kritisk til alt spirituelt og "&aring;ndelig", og jeg har vanskelig for &aring; sympatisere med folk som bruker &nbsp;uttrykk som "skjebnen", "livsenergier" og s&aring; videre.</p>
<p>Det er nettopp det denne boken er full av. Forfatteren beskriver den som "symbolsk", men det er bare en annen m&aring;te &aring; si "bullshit" p&aring;.</p>
<p>Boken handler om hovedpersonens reise til Egypt. Han var en gjeter som hadde dr&oslash;mt at han ville finne en skatt i Egypt. P&aring; veien snakker han med vinden, med Gud, og det fortelles masse symbolske historier. Hele greia er at det ikke er mulig &aring; forst&aring; "verdenssjelen" med normale ord - alt m&aring; forst&aring;s symbolsk.</p>
<p>Jeg avslutter med noe forfatteren fortalte om i etterordet:</p>
<blockquote><p>&nbsp;En kveld, mens vi satt og pratet etter en slitsom runde med telepati, spurte jeg hvorfor alkymistenes spr&aring;k var s&aring; vagt og innfl&oslash;kt.</p></blockquote>
<p>!!!! Forfatteren, Coelho, og hans l&aelig;remester, som bare blir kalt "RAM", brukes alts&aring; kveldene p&aring; telepati og alkymi.</p>
<p>Boken anbefales ikke, men er veldig kort.</p>
