---
layout: post
status: publish
published: true
title: '"Philosophy of Science - A Very Short Introduction"'
author:
  display_name: FredrikMeyer
  login: FredrikMeyer
  email: hrmeyer@gmail.com
  url: ''
author_login: FredrikMeyer
author_email: hrmeyer@gmail.com
wordpress_id: 576
wordpress_url: http://sphere.fredrikmeyer.net/?p=576
date: '2012-12-09 23:24:04 +0100'
date_gmt: '2012-12-09 22:24:04 +0100'
categories:
- anmeldelser
tags: []
comments:
- id: 2229
  author: Tim
  author_email: gewgweg@gmail.com
  author_url: ''
  date: '2013-05-13 19:38:29 +0200'
  date_gmt: '2013-05-13 17:38:29 +0200'
  content: "Tror du vil like disse:\r\n\r\nhttp://owningyourshit.blogspot.no/2013/04/my-address-to-ny-state-libertarian.html\r\n\r\nhttp://captaincapitalism.blogspot.no/\r\n\r\nhttp://voxday.blogspot.no/"
---
<p>&Aring; lese filosofi kan v&aelig;re morsomt - s&aring; lenge det ikke kommer i form av exphil (alle som har tatt <a href="http://www.uio.no/studier/emner/hf/ifikk/EXPHIL03/">exphil</a> ved UiO skj&oslash;nner hva jeg mener).<a href="http://sphere.fredrikmeyer.net/wp-content/uploads/averyshortintroduction.png"><img class="alignright size-full wp-image-577" title="A Very Short Introduction to Philosophy of Science" src="http://sphere.fredrikmeyer.net/wp-content/uploads/averyshortintroduction.png" alt="" width="305" height="500" /></a></p>
<p>&Aring; lese matematikk inneb&aelig;rer &aring; absorbere masse ideer og sannheter. Det eneste som er oppe til diskusjon, er hva ideene "<a href="http://cheng.staff.shef.ac.uk/morality/morality.pdf">moralsk</a>" skal bety - hva er den geometriske tolkningen av denne algebraiske sannheten? Uansett - n&aring;r noe er bevist, er det bare nok et faktum.</p>
<p>&Aring; lese filosofi er, naturlig nok, annerledes. Du har en problemstilling, og naturlig nok har du allerede en vag mening om saken - og det f&oslash;rste du f&aring;r er argumentasjon som er enig med deg. Du er forn&oslash;yd, men like etterp&aring; f&aring;r du solide argumenter&nbsp;<em>mot&nbsp;</em>din posisjon.</p>
<p>Det er en intellektuell pr&oslash;velse/&oslash;velse, og veldig underholdende n&aring;r det gj&oslash;res riktig. Likevel blir jeg alltid litt frustrert av &aring; lese slik filosofi (filosofer skriver selvsagt ofte mer konklusivt - da de ofte har en konklusjon &aring; formidle). Konklusjonen henger liksom i luften, men like f&oslash;r du skal til &aring; gripe den, blir den spiddet av skarpe argumenter. To b&oslash;ker jeg har lest har gitt meg denne typen intellektuell stimulering. Den f&oslash;rste var <a href="http://en.wikipedia.org/wiki/Bertrand_Russell">Bertrand Russels</a> "<a href="http://en.wikipedia.org/wiki/The_Problems_of_Philosophy">The Problems of Philosophy</a>" og den andre var, som tittelen av bloggposten henviser til, "<a href="http://www.amazon.com/Philosophy-Science-Very-Short-Introduction/dp/0192802836">Philosophy of Science - A Very Short Introduction</a>".</p>
<p>Boken er godt skrevet (noe som ikke er standard for b&oslash;kene i samme serie, dessverre!) - og intellektuelt stimulerende p&aring; m&aring;ten beskrevet over. Anbefales.</p>
