---
layout: post
status: publish
published: true
title: Matematisk julepynt
author:
  display_name: FredrikMeyer
  login: FredrikMeyer
  email: hrmeyer@gmail.com
  url: ''
author_login: FredrikMeyer
author_email: hrmeyer@gmail.com
wordpress_id: 236
wordpress_url: http://cube.fredrikmeyer.net/?p=236
date: '2013-12-12 11:23:58 +0100'
date_gmt: '2013-12-12 10:23:58 +0100'
categories:
- Uncategorized
tags: []
comments: []
---
<p>Det er jul og eksamenstid. Det betyr at vi har ekstra motivasjon til &aring; gj&oslash;re ting som ikke inneb&aelig;rer &aring; lese til eksamen - for eksempel &aring; lage julepynt.</p>
<h2>F&oslash;rst en liten forhistorie</h2>
<p>Et <a href="http://en.wikipedia.org/wiki/Polyhedron">polyeder</a> er en matematisk figur som er satt sammen av polygoner. Eksempler p&aring; polyedre er:</p>
<p><a href="http://cube.fredrikmeyer.net/wp-content/uploads/image003.gif"><img class=" wp-image-240 alignright" alt="image003" src="http://cube.fredrikmeyer.net/wp-content/uploads/image003.gif" width="160" height="160" /></a> <a href="http://cube.fredrikmeyer.net/wp-content/uploads/Leonardo_polyhedra.png"><img class=" wp-image-241 alignleft" alt="Leonardo_polyhedra" src="http://cube.fredrikmeyer.net/wp-content/uploads/Leonardo_polyhedra-282x300.png" width="197" height="210" /></a></p>
<p>Polyedret til venstre er satt sammen av 18 kvadrater og 8 trekanter. Polyedret til h&oslash;yre, ogs&aring; kjent som en s&aring;kalt "<a href="http://en.wikipedia.org/wiki/Truncated_icosahedron">fotball</a>" (red. anm: utstyr brukt av sportsinteresserte), er satt sammen av 12 femkanter og 20 sekskanter.</p>
<p>Men noen polyedre er likere enn andre. Dette er polyedre som er satt sammen av helt like figurer, og der alle figurene m&oslash;tes p&aring; samme m&aring;te i hvert hj&oslash;rne. Dette er de <a href="http://en.wikipedia.org/wiki/Platonic_solid"><em>platonske legemene</em></a>:</p>
<p style="text-align: center;">&nbsp;<a href="http://cube.fredrikmeyer.net/wp-content/uploads/platonic.png"><img class="size-medium wp-image-243 aligncenter" alt="platonic" src="http://cube.fredrikmeyer.net/wp-content/uploads/platonic-300x187.png" width="300" height="187" /></a></p>
<p>Disse er satt sammen av trekanter, kvadrater eller femkanter. Det gule polyedret er satt sammen av fire trekanter, det gr&oslash;nne er satt sammen av &aring;tte trekanter, det r&oslash;de er satt sammen av seks kvadrater (red. anm: ogs&aring; kalt en <em>terning</em>). Det lilla er satt sammen av 20 trekanter, og det bl&aring; er satt sammen av 12 femkanter. De kalles (i samme rekkef&oslash;lge) for tetraeder, oktaeder, hexaeder, icosaeder og dodekaeder (p&aring; engelsk bytter man ut "eder" med "hedron").</p>
<p>Her er en funfact kjent som <a href="http://en.wikipedia.org/wiki/Euler_characteristic">Eulers teorem</a>: teller du antall hj&oslash;rner (H), antall kanter (E) og antall flater (F) i figurene over, f&aring;r du alltid at forskjellen H-E+F=2. (pr&oslash;v selv!)</p>
<h2>Julepynt</h2>
<p>N&aring; har vi kommet til poenget med denne posten. Polyedre eksisterer ikke bare i matematikernes fantasi, men ogs&aring; p&aring; juletr&aelig;rne - ihvertfall om man henger dem der. Du m&aring; bare lage dem f&oslash;rst.</p>
<p>Alt du trenger er piperensere, gjerne av typen som glitrer. Jeg fant mine p&aring; juggelbutikken "Tiger" p&aring; Arkaden i Oslo. Antakelig selges de andre steder ogs&aring;.</p>
<p>Greia er f&oslash;lgende: bruk en linjal, og brett piperenserne slik at du deler dem i tre, fire, eller fem like store deler (ha en liten del til overs slik at du "knyte" kantene). S&aring; setter man dem sammen. Her er noen bilder:</p>
<p style="text-align: left;"><a href="http://cube.fredrikmeyer.net/wp-content/uploads/2013-12-12-10.40.18.jpg"><img class="size-medium wp-image-237 aligncenter" alt="2013-12-12 10.40.18" src="http://cube.fredrikmeyer.net/wp-content/uploads/2013-12-12-10.40.18-e1386843183920-300x125.jpg" width="300" height="125" /></a>De over er tetraederet, kuben og oktaederet. (Beklager bildekvaliteten, men jeg skal liksom drive med matematikk og ikke drasse p&aring; gode kameraer!)<a href="http://cube.fredrikmeyer.net/wp-content/uploads/2013-12-12-10.40.22.jpg"><img class="size-medium wp-image-238 aligncenter" alt="2013-12-12 10.40.22" src="http://cube.fredrikmeyer.net/wp-content/uploads/2013-12-12-10.40.22-e1386843303898-300x172.jpg" width="300" height="172" /></a>Her er oktaederet p&aring; nytt, og p&aring; h&oslash;yresiden er dodekaederet.</p>
<p style="text-align: left;"><a href="http://cube.fredrikmeyer.net/wp-content/uploads/2013-12-12-10.40.30-e1386841988212.jpg"><img class="size-medium wp-image-239 aligncenter" alt="2013-12-12 10.40.30" src="http://cube.fredrikmeyer.net/wp-content/uploads/2013-12-12-10.40.30-e1386841988212-300x125.jpg" width="300" height="125" /></a>Til slutt har vi ikosaederet. Det var vanskeligst &aring; lage, og ble ikke s&aring; veldig symmetrisk. Utfordring: gj&oslash;r det bedre selv.</p>
