---
layout: post
status: publish
published: true
title: Et streiftog blant utvalgte matematikere
author:
  display_name: fredrikmeyer
  login: fredrikmeyer
  email: hrmeyer@gmail.com
  url: ''
author_login: fredrikmeyer
author_email: hrmeyer@gmail.com
wordpress_id: 21
wordpress_url: http://fredrikmeyer.net/?p=21
date: '2016-10-02 17:20:18 +0200'
date_gmt: '2016-10-02 15:20:18 +0200'
categories:
- Matematikk
- Popularisering
tags: []
comments: []
---
<p>Man tenker p&aring; matematikere som fjerne mennesker uten s&aelig;rlig stor grad kontakt med virkeligheten. De g&aring;r rundt i sin egen verden, krasjer i lyktestolper mens de tenker p&aring; problemer, og bryr seg ikke om utseendet. Ingen stereotypi er ubegrunnet, og dette gjelder selvsagt ogs&aring; for matematikere.<img class="alignright" src="http://www.mlahanas.de/Greeks/images/Archimedes_htm_m29b58180.jpg" width="276" height="248" name="Graphic1" align="BOTTOM" border="0" /></p>
<p>Arkimedes, en av de store tidlige matematikerne, var et typisk eksempel p&aring; en fjern matematiker. Da byen Syrakus ble invadert av romerne, l&oslash;ste Arkimedes geometriproblemer i sanden. En soldat skal ha kommandert ham til &aring; m&oslash;te generalen, men Arkimedes nektet, og svarte &laquo;Ikke forstyrr mine sirkler!&raquo;. Soldaten ble forn&aelig;rmet, og drepte Arkimedes.</p>
<p>D<img class="alignright" src="http://todayinsci.com/G/Germain_Sophie/GermainSophie300px.jpg" width="162" height="217" />et er lett &aring; la seg fascinere av en slik fascinasjon. Det var akkurat det Sophie Germain gjorde p&aring; 1700-tallet. Som barn var hun n&oslash;dt til &aring; holde seg inne p&aring; grunn av revolusjon i gatene i Paris. Hun brukte tiden til &aring; lese i farens bibliotek, og kom over historien om Arkimedes&acute; d&oslash;d. Sophie tenkte at om noen kunne v&aelig;re s&aring; fascinert av matematikk s&aring; m&aring;tte det v&aelig;re fantastisk interessant. Hun begynte &aring; lese alle matematikkb&oslash;kene i farens bibliotek, og skal til og med ha l&aelig;rt seg gresk og latin for &aring; kunne lese verkene til Newton og Euklid. Siden matematikk ikke var en passende aktivitet for unge piker, fant foreldrene til Sophie p&aring; metoder for &aring; holde henne unna matematikken. De gjemte vekk varme kl&aelig;r, fjernet stearinlysene og slo av varmen slik at Sophie ikke skulle ha muligheten til &aring; lese matematikk om kveldene. Men Sophie var slu. Hun hadde et hemmelig lager med stearinlys, og om kveldene tullet hun seg inn i lakner og leste matematikk. Da foreldrene oppdaget henne en morgen, frossen og sovende, p&aring; pulten med tavlen full av formler og blekket i blekkhuset frosset, skj&oslash;nte de at nok var nok, og at det var p&aring; tide &aring; la henne f&aring; arbeide med matematikken som hun ville. Det var et klokt valg, og Sophie endte opp med &aring; gj&oslash;re viktige bidrag til matematikken.</p>
<p>Men matematikere er ikke bare totalt oppslukt i arbeidet sitt, de e<img class="alignright" src="https://upload.wikimedia.org/wikipedia/commons/3/35/Ghhardy%4072.jpg" width="217" height="256" />r ogs&aring; ofte pussige mennesker. Godfrey Harold Hardy var en brite med sin storhetsperiode p&aring; begynnelsen av forrige &aring;rhundre. I en artikkel, &laquo;A mathematician's apology&raquo;, skriver Hardy at hovedgrunnen til at han liker matematikk s&aring; godt, er at det er totalt ubrukelig. Hardys felt var nemlig tallteori, et matematisk felt hvor man ikke regnet p&aring; kanonkuler, sjokkb&oslash;lger, eller noe annet av praktisk betydning &ndash; trodde han. Hardy kunne vanskelig ta mer feil. Hans felt, tallteori, er bakgrunnen for sikker kryptering p&aring; internett og bankterminaler. Hardy hadde sine s&aelig;regenheter, og han skal ha nektet &aring; bruke armb&aring;ndsur og telefon, og insisterte p&aring; &aring; &aring; bruke telegram og postkort&nbsp;til &aring; kommunisere med. Hans store lidenskap etter matematikk var cricket. Hardy giftet seg aldri, men skal ha hatt korte platoniske forhold med unge menn.</p>
<p>Om Hardy var pussig, s&aring; blir han forbig&aring;tt langt p&aring; vei av Paul Erd&ouml;s. Erd&ouml;s ble f&oslash;dt i Ungarn i 1913 og skal ha utviklet matematisk talent sv&aelig;rt tidlig: som tre&aring;ring skal han ha kunnet regne ut hvor mange sekunder en person hadde levd. Som 21-&aring;ring fikk han doktograden sin, og han underviste noen &aring;r i Manchester og Princeton. Etterhvert begynte han med sin karakterisiske vane med &aring; reise rundt mellom forskjellige matematikkfakulteter rundt omkring i verden. Han ble aldri lenge p&aring; et sted, og fortsatte med dette hele livet. Eiendeler betydde lite for Erd&ouml;s, og de fleste eiendelene hans fikk plass i en koffert. Han dukket ofte opp p&aring; d&oslash;ren hos en matematiker og erkl&aelig;rte at &laquo;hans hjerne er &aring;pen&raquo;. Der ville de samarbeide og skrive noen artikler, f&oslash;r Erd&ouml;s dro til neste matematiker.</p>
<p>Et sitat Erd&ouml;s er kjent for, er at &laquo;en matematiker er en maskin for &aring; gj&oslash;re om kaffe til teoremer&raquo;, og Erd&ouml;s skal ha v&aelig;rt en stor kaffeforbruker. Koffein var ikke det eneste rusmidlet Erd&ouml;s hadde et stort forbruk av: han brukte jevnlig amfetamin. En venn veddet $500 p&aring; at han ikke kunne klare et m&aring;ned uten stoffet, men tapte. Etter m&aring;neden uten amfetamin, begynte han raskt igjen, for som han selv sa: &laquo;F&oslash;r, n&aring;r jeg s&aring; p&aring; et blankt ark, ble hodet mitt fylt av ideer. N&aring; er alt jeg ser et tomt ark.&raquo;</p>
<p><img class="alignright" src="https://upload.wikimedia.org/wikipedia/commons/f/f1/Erdos_head_budapest_fall_1992.jpg" />Erd&ouml;s snakket ofte om &laquo;Boken&raquo;, hvor de aller vakreste matematiske bevisene var skrevet ned av &laquo;Gud&raquo;. Han tvilte selv p&aring; Guds eksistens, og kalte ham for &laquo;den st&oslash;rste fascisten&raquo;, og anklaget ham for &aring; gjemme sokkene og det ungarske passet hans, og for &aring; holde de mest elegante matematiske bevisene for seg selv. N&aring;r han kom over et spesielt elegant bevis, ville han utbasunere at&nbsp;&laquo;denne er fra Boken!&raquo;. Han hadde en spesiell ordbruk, og kalte sm&aring; barn for &laquo;epsiloner&raquo; (matematikere bruker den greske bokstaven epsilon til &aring; representere et veldig lite tall), kvinne var &laquo;sjefer&raquo;, menn var &laquo;slaver&raquo;, personer som hadde sluttet med matematikk hadde &laquo;d&oslash;dd&raquo;, personer som hadde giftet seg hadde blitt &laquo;fanget&raquo;, og personer som skilte seg var &laquo;frigjort&raquo;. &Aring; holde et matematikkforedrag var &aring; &laquo;preke&raquo;, og &aring; gi en student en muntligeksamen var &aring; &laquo;torturere&raquo; ham/henne. Erd&ouml;s foreslo at teksten p&aring; gravstenen hans skulle v&aelig;re &laquo;n&aring; har jeg endelig sluttet &aring; bli dummere&raquo;.</p>
<p><img class="alignright" src="http://www.edinformatics.com/great_thinkers/Godel_3.jpg" width="201" height="285" />Det forrige &aring;rhundrets st&oslash;rste logiker var nesten uten tvil Kurt G&ouml;del, som beviste sine to ber&oslash;mte ukompletthetsteoremer. G&ouml;del ble f&oslash;dt i &Oslash;sterrike i 1906, og viste tidlig matematiske talenter. Allerede som 18-&aring;ring behersket han universitetsmatematikk, og ble Privatdozent som 27-&aring;ring. P&aring; denne tiden kom nazistene til makten ogs&aring; i &Oslash;sterrike, og p&aring; grunn av sine j&oslash;diske kontakter s&aring; G&ouml;del seg n&oslash;dt til &aring; flykte til USA &ndash; noe han gjorde p&aring; den transsibirske jernbanen, seilte fra Japan til San Fransisco, s&aring; tog til Princeton, hvor han fikk en professorstilling. Her ble han kjent med Albert Einstein, og de ble sv&aelig;rt gode venner. P&aring; slutten av livet skal Einstein ha sagt at hans eget arbeid ikke lenger betydde s&aelig;rlig, og at den eneste grunnen til at han kom p&aring; Princeton, var &aring; f&aring; g&aring; spaserturer med G&ouml;del.</p>
<p>G&ouml;del led av diverse psykiske lidelser, og skal ha hatt en konstant frykt for &aring; bli forgiftet. Han nektet &aring; spise noen mat f&oslash;r konen hans, Adele, hadde smakt p&aring; maten f&oslash;rst. Da Adele tilbrakte seks m&aring;neder p&aring; sykehus, sultestreiket G&ouml;del, og endte opp med &aring; sulte seg i hjel.</p>
<hr />
<p>Teksten over ble publisert i tidsskriftet&nbsp;Argument, nummer 5, 2010.</p>
