---
layout: post
status: publish
published: true
title: To ensomme ulver
author: Fredrik Meyer
author_login: fredrikmeyer
author_email: hrmeyer@gmail.com
wordpress_id: 135
wordpress_url: http://fredrikmeyer.net/?p=135
date: '2017-04-05 18:17:38 +0200'
date_gmt: '2017-04-05 16:17:38 +0200'
categories:
- Matematikk
- Popularisering
tags: []
comments: []
---
<p>Denne teksten ble publisert i&nbsp;tidsskriftet Argument nr 1 2017. For &aring; se hvordan det s&aring; ut trykket, kan teksten leses p&aring; nett <a href="http://argumentnett.no/papirutgave/">hos Argument</a>&nbsp;(klikk p&aring; lenken og finn utgave &eacute;n 2017).</p>

<hr />
<p><img style="float:right" class="size-medium wp-image-141" src="http://fredrikmeyer.net/wp-content/uploads/2017/04/andrewwilesoffice-300x225.jpg" alt="" width="300" height="225" /> Andrew Wiles' kontor. Bildet er hentet fra dokumentaren til Simon Singh.</p>

<p><strong>Klisjematematikeren</strong> er en distre mann med rotete kontor. Han er en ensom ulv som lever i sin egen tankeverden, gjerne up&aring;virket av tidens mote og akademisk byr&aring;krati. Akkurat som de fleste andre klisjeer, har denne en rot i virkeligheten. De ensomme ulvene finnes, men de er sjeldent representative for matematikere generelt.</p>

<p>Akkurat som i de fleste andre yrkesgrupper er matematikk et samarbeidsprosjekt. Vi har seminarer, vi arrangerer konferanser og workshops. Vi samarbeider om artikler, og vi diskuterer v&aring;re funn og v&aring;re innsikter. Matematikere kommer i alle former og typer, som regel er de normale mennesker med en ikke s&aring; veldig vanlig jobb.</p>

<p>Likevel er det de ensomme ulvene som fascinerer. Folk som Steve Jobs, Bill Gates, Alan Turing, Albert Einstein, Isaac Newton, Platon. Disse forandret verden, tross stor motgang, og hadde en drivkraft de fleste av oss ikke kan annet enn &aring; misunne. I alle fagfelt dukker denne typen person jevnlig opp og revolusjonerer ofte m&aring;ten man tenker p&aring;. Etterp&aring; m&aring; ideene deres bearbeides og arbeides inn i tankegangen til resten av vitenskapen.</p>

<p>I matematikken har det i de siste ti&aring;rene v&aelig;rt to personer som kanskje har utmerket seg mer enn andre. Den ene jeg tenker p&aring; er <a href="https://en.wikipedia.org/wiki/Andrew_Wiles">Andrew Wiles</a>, som vant Abelprisen i mai i &aring;r. Den andre jeg tenker p&aring;, er <a href="https://en.wikipedia.org/wiki/Yitang_Zhang">Yitang Zhang</a>, som gjorde store framskritt p&aring; den s&aring;kalte <a href="https://en.wikipedia.org/wiki/Twin_prime">tvillingprimtallsformodningen</a>.</p>

<p><img style="float:right"  class="size-medium wp-image-139" src="http://fredrikmeyer.net/wp-content/uploads/2017/04/andrewwiles-300x200.jpeg" alt="" width="300" height="200" /> Andrew Wiles etter at han mottok Abel-prisen i 2016. Bildet er hentet fra Abelprisens nettsider.</p>

<p>Det Andrew Wiles er kjent for, er hans l&oslash;sning av <a href="https://en.wikipedia.org/wiki/Fermat%27s_Last_Theorem">Fermats siste sats</a>. Det er et veldig morsomt problem, fordi det er ikke s&aring; vanskelig &aring; forklare problemet, men l&oslash;sningen er ekstremt avansert. Tenk tilbake til ungdomsskolen, og p&aring; <a href="https://en.wikipedia.org/wiki/Pythagorean_theorem">Pythagoras</a>. Da l&aelig;rte man at hvis man har en rettvinklet trekant, s&aring; er summen av kvadratene til de to korteste sidene lik kvadratet til den lengste siden. Eller med bokstaver: $ a^2+b^2=c^2$. Denne ligningen har den pene egenskapen at den har heltallsl&oslash;sninger: setter vi $ a=3$, $ b=4$ og $ c=5$, ser vi at vi f&aring;r en l&oslash;sning fordi $ 9+16=25$ (faktisk finnes det uendelig mange heltallsl&oslash;sninger). Det Fermat p&aring;stod, var at om vi bytter ut 2-tallet i ligningen med en h&oslash;yere eksponent, s&aring; har ikke ligningen noen l&oslash;sninger! I bokstaver: ligningen $ a^n+b^n=c^n$ har ingen heltallsl&oslash;sninger n&aring;r n er st&oslash;rre enn 2.</p>

<p>Fermat p&aring;stod han hadde et bevis for denne p&aring;standen, men han skrev dette aldri ned. I 350 &aring;r pr&oslash;vde matematikere &aring; bevise formodningen, helt til Wiles endelig skj&oslash;t gullfuglen i 1993.</p>

<p>Helt siden Wiles var barn, hadde han v&aelig;rt interessert i tallteori og spesielt i Fermats siste sats. P&aring; 70- og 80-tallet begynte det &aring; bli klart at l&oslash;sningen av et annet problem ville medf&oslash;re en l&oslash;sning av Fermats siste sats. Det var dette problemet, Taniyama-Shimura-Weil-formodningen, som Wiles klarte &aring; l&oslash;se. Han skj&oslash;nte p&aring; et tidspunkt at dette problemet kunne han kanskje klare &aring; l&oslash;se, og han bestemte seg for &aring; bruke all sin forskningstid i hemmelighet p&aring; dette problemet. Han arbeidet hjemmefra, og kun hans kone visste hva han jobbet med. Fra 1987 til 1993 jobbet han helt alene, og publiserte samtidig deler av tidligere arbeider for ikke &aring; vekke mistanke.</p>

<p>Han annonserte beviset i 1993, men det kom etter kort tid fram at beviset hadde et hull. Wiles pr&oslash;vde &aring; tette hullet i et &aring;rs tid, og ga p&aring; et tidspunkt nesten opp. Sammen med sin tidligere student, Richard Taylor, klarte han &aring; tette hullet, og det endelige beviset ble publisert i 1995 i en egen utgave av <a href="https://www.jstor.org/stable/2118559?seq=1#page_scan_tab_contents">Annals of Mathematics</a>.</p>

<p>Dette gjorde Wiles til kjendis over natten, og han er kanskje den eneste vitenskapsmannen sammen med Einstein som i de siste hundre &aring;rene har skapt avisoverskrifter verden over for sitt arbeid. Beviset hans var betydningsfullt nok til at Abelkomiteen i &aring;r bestemte at han fortjente <a href="http://www.abelprisen.no/c67110/seksjon/vis.html?tid=67111">Abelprisen</a> som ble delt ut 24. mai av Kronsprins H&aring;kon i universitetets aula.</p>

<p><img style="float:right"  class="size-medium wp-image-140" src="http://fredrikmeyer.net/wp-content/uploads/2017/04/yitangzhang-300x169.jpg" alt="" width="300" height="169" /> Yitang Zhang som foreleser. Bildet er hentet fra en <a href="https://www.youtube.com/watch?v=CrUsP-MtXDM">YouTube-video</a> fra University of New Hampshire.</p>

<p>Over til Yitang Zhang og tvillingprimtallformodningen. Tvillingprimtall er par av primtall som er n&aelig;rmest mulig hverandre: eksempler er 2 og 3, 3 og 5, 5 og 7, 11 og 13, 29 og 31, og s&aring; videre. Formodningen sier at det finnes uendelig mange slike par av primtall: uansett hvor langt ut i tallrekken vi g&aring;r, vil vi alltid klare &aring; finne to slike naboprimtall.</p>

<p>Zhang var inntil for noen f&aring; &aring;r siden en helt ukjent matematiker. Han slet med &aring; f&aring; en fast stilling, og jobbet p&aring; et tidspunkt deltid p&aring; Subway. Han fikk mastergraden sin fra Universitetet i Peking i 1984 og tok doktorgraden sin i USA ved Purdue University. Etter noe tid utenfor akademia, fikk han til slutt en undervisningsstilling ved University of New Hampshire.</p>

<p>I 2009 begynte han &aring; jobbe seri&oslash;st p&aring; tvillingprimtallsformodningen, et problem han lenge hadde v&aelig;rt interessert i. Etter flere &aring;rs arbeid, klarte han &aring; gj&oslash;re noe ingen hadde klart f&oslash;r ham: han viste at det finnes uendelig mange primtall med en avstand p&aring; 70 millioner (i stedet for 2, som i formodningen). Selv om dette kan h&oslash;res ut som langt fra et faktisk framskritt, var dette et enormt steg i riktig retning. F&oslash;r Zhangs bevis, hadde ingen noen anelse om hvordan man skulle vise noen slik begrensning.</p>

<p>Kort tid etter at han publiserte beviset, fikk han en full professorstilling. Det skjedde ogs&aring; noe som passer godt inn i v&aring;r internetttidsalder: det ble opprettet et s&aring;kalt Polymath-prosjekt: matematikere fra hele verdensveven samarbeidet om &aring; forbedre begrensningen i beviset til Zhang, og etter f&aring; m&aring;neder var 70 millioner redusert til 246. Det store gjennombruddet ble alts&aring; gjort av Zhang, men finpussingen ble gjort av det store matematikersamfunnet.</p>

<p>Hva er det som fascinerer s&aring; mye med disse to matematikerne? Begge er ensomme ulver som klarer &aring; jobbe motivert og lenge uten press og tilbakemelding fra andre. Begge klarte &aring; bevise noe ingen trodde var mulig. Og begge ble kjendiser over natta.</p>

<p>Vi trenger de ensomme ulvene til &aring; inspirere oss. Vi trenger &aring; h&oslash;re om folk med p&aring;gangsmot og viljestyrke, som klarer det umulige.</p>

<p>Likevel er det ogs&aring; viktig &aring; v&aelig;re takknemlige for institusjonene rundt som gj&oslash;r heltene mulige. Vi trenger ogs&aring; de flittige arbeiderne og forskerne, som kanskje aldri utretter noe stort, men som likevel trengs for &aring; holde maskinen i gang. Det er disse som skriver l&aelig;reb&oslash;kene, som finpusser tidligere resultater, og som l&aelig;rer opp neste generasjon forskere.</p>

