---
layout: post
status: publish
published: true
title: Mine favorittpodcaster
author:
  display_name: fredrikmeyer
  login: fredrikmeyer
  email: hrmeyer@gmail.com
  url: ''
author_login: fredrikmeyer
author_email: hrmeyer@gmail.com
wordpress_id: 45
wordpress_url: http://fredrikmeyer.net/?p=45
date: '2017-02-01 20:49:30 +0100'
date_gmt: '2017-02-01 19:49:30 +0100'
categories:
- Anmeldelser
tags: []
comments: []
---
<h2>Favorittpodcaster</h2>
<p>Jeg h&oslash;rer mye p&aring; podcaster.&nbsp;De er en fin m&aring;te &aring; l&aelig;re nye ting p&aring; mens man gj&oslash;r andre ting (sykle til jobb, gj&oslash;re husarbeid, holde ut offentlig transport, ...).</p>
<p>Her er noen av&nbsp;favorittpodcastene mine. Listen er ikke n&oslash;dvendigvis prioritert, da dette neppe er en <a href="https://en.wikipedia.org/wiki/Total_order">total ordning</a>. Hvilken podcast som er best avhenger av anledning, v&aring;kenhet og hum&oslash;r.</p>
<h2><a href="http://www.theskepticsguide.org/">Skeptics Guide to the Universe</a></h2>
<p><img class="alignright size-full wp-image-115" src="http://fredrikmeyer.net/wp-content/uploads/2017/01/SGU-Logo-for-homepage_1091.png" alt="" width="257" height="109" />Dette er nok den podcasten jeg har h&oslash;rt p&aring; lengst. Det kommer ukentlige episoder,&nbsp;og jeg har f&aring;tt med meg alle siden 2009.</p>
<p>Podcasten er dedikert til vitenskapsnyheter og skeptisisme. De bruker tid p&aring; &aring; dekonstruere homeopati, kopping, og andre alternative "behandlinger" i nyhetene. Spesielt morsomt er det &aring; h&oslash;re p&aring; Steven Novellas rants om forskjellig medisinsk overtro.</p>
<h2><a href="https://morgenbladet.no/podcast">Morgenbladets podcast</a></h2>
<p><img class="alignright size-medium wp-image-116" src="http://fredrikmeyer.net/wp-content/uploads/2017/01/Skjermbilde-2017-01-21-14.02.32-300x300.png" alt="" width="300" height="300" />Jeg abonnerer p&aring; Morgenbladet, men rekker aldri &aring; lese mer enn &eacute;n artikkel per uke (det beste med Morgenbladet er forresten filmanmeldelsene, de er kjempemorsomme). Morsomme temaer, artige intervjuer, og&nbsp;fin m&aring;te &aring; f&aring; med seg innholdet i ukens avis uten faktisk &aring; ha lest den.</p>
<p>Mulig favorittepisode: muligens den der <a href="https://soundcloud.com/morgenbladet-780386031/66-harald-eia-sosteren-og-psykiateren">Harald Eia snakker om s&oslash;sterens rusmisbruk</a>. Eller kanskje den aller f&oslash;rste episoden, et&nbsp;<a href="https://soundcloud.com/morgenbladet-780386031/nashmorgenbladetpodpilot">intervju med Abel-prisvinneren John Nash</a>, bare dager f&oslash;r han d&oslash;de.</p>
<h2><a href="https://www.samharris.org/podcast">Sam Harris - Waking Up</a></h2>
<p><img class="alignright size-medium wp-image-119" src="http://fredrikmeyer.net/wp-content/uploads/2017/01/waking_up_podcast-300x300.png" alt="" width="300" height="300" />Sam Harris er en av mine favorittenkere.&nbsp;Kort oppsummert: han er av de kjente ateistene, han er Islam-kritiker, og han mener spiritualitet er viktig (boken hans, "<a href="https://www.amazon.com/Waking-Up-Spirituality-Without-Religion/dp/1451636024/ref=sr_1_1?ie=UTF8&amp;qid=1485004537&amp;sr=8-1&amp;keywords=waking+up">Waking Up - A Guide to Spirituality Without Religion</a>", anbefales!).</p>
<p>Hver episode er vanligvis et intervju med en person om aktuelle temaer han interesserer seg for. En av de mer interessante episodene var et <a href="https://www.samharris.org/podcast/item/the-putin-question">intervju med Garry Kasparov</a>, hvor de snakker om ting som Donald Trump, Russland, og sjakk og kunstig intelligens.</p>
<p>Mulig favorittepisode: "<a href="https://www.samharris.org/podcast/item/abusing-dolores">Abusing Dolores</a>".&nbsp;Dette er en samtale med&nbsp;en psykologiprofessor om empati, meditasjon, om vold mot kunstig intelligens i TV-serien Westworld, og selvf&oslash;lgelig litt ranting om Trump.</p>
<h2><a href="https://podcastomrus.wordpress.com/">Podcast om Rus</a></h2>
<p><img class="alignright size-medium wp-image-120" src="http://fredrikmeyer.net/wp-content/uploads/2017/01/cropped-por15-300x300.jpg" alt="" width="300" height="300" />Mildt sagt mye k&oslash;dd.&nbsp;To morsomme karer, <a href="https://twitter.com/reynolds420?lang=no">B&oslash;ffert Fusk</a> og <a href="https://twitter.com/superstaale">Per St&aring;le Honning</a>&nbsp;(begge er morsomme p&aring; Twitter forresten), lager ikke s&aring; veldig jevnlig episoder om rusrelaterte temaer.</p>
<p>De g&aring;r igjennom hva som har skjedd i den norske rusdebatten siden forrige episode, og snakker s&aring;&nbsp;<em>veldig</em>&nbsp;l&oslash;st s&aring; om episodens tema.</p>
<h2><a href="http://www.npr.org/sections/money/">Planet Money</a></h2>
<p><img class="alignright size-medium wp-image-123" src="http://fredrikmeyer.net/wp-content/uploads/2017/01/planetmoney-300x300.png" alt="" width="300" height="300" />Planet Money er en av NPR sine beste podcaster. Hver episode tar for seg et &oslash;konomi eller politikk eller penge-relatert tema, og gj&oslash;r det morsomt og interessant.</p>
<p>I &eacute;n episode&nbsp;opps&oslash;ker de for eksempel <a href="http://www.npr.org/sections/money/2016/12/02/504155809/episode-739-finding-the-fake-news-king">en som lager falske nyheter</a>, og graver i hvordan han endte opp med dette. I en annen snakker de om <a href="http://www.npr.org/sections/money/2016/11/30/503769949/episode-534-the-history-of-light">historien til lyset</a> (lamper).</p>
<p>Mulig favorittepisode: "<a href="http://www.npr.org/sections/money/2015/09/16/440951873/episode-651-the-salmon-taboo">The Salmon Taboo</a>". Tidligere spiste&nbsp;ikke japanere sushi av laks. Ikke f&oslash;r en gjeng norske entrepren&oslash;rer satte i gang en enorm reklamekampanje for norsk laks i japan.</p>
<h2><a href="http://freakonomics.com/">Freakonomics</a></h2>
<p><img class="alignright size-medium wp-image-125" src="http://fredrikmeyer.net/wp-content/uploads/2017/01/freakonomics-big-300x174.jpg" alt="" width="300" height="174" />Dette er ogs&aring; en av podcastene jeg har h&oslash;rt p&aring; lengst. Journalist Stephen Dubner og &oslash;konom Steven Levitt&nbsp;forteller historier fra &oslash;konomi- og samfunnsverden. Sjangeren er veldig lik Planet Money, men kanskje hakket mer fokus p&aring; overraskende og kontra-intuitiv kunnskap.</p>
<p>Mulig f&oslash;rste episode &aring; h&oslash;re p&aring;: Denne <a href="http://freakonomics.com/podcast/a-better-way-to-eat-a-new-freakonomics-radio-podcast/">episoden handler om&nbsp;Takeru Kobayashi</a>, en liten spinkel japaner som deltar i spisekonkurranser, og om hvordan han klarte &aring; bli verdensmester.</p>
<h2><a href="http://www.npr.org/podcasts/510308/hidden-brain">Hidden Brain</a></h2>
<p><img class="alignright size-medium wp-image-128" src="http://fredrikmeyer.net/wp-content/uploads/2017/02/hiddenbrain_sq-c52ddc28021ba306c99f2a94f06e0f649b0b62cd-s700-c85-300x300.jpg" alt="" width="300" height="300" />Nok en podcast i NPR-familien. Hidden Brain handler om psykologi og samfunn, fortalt via historier.</p>
<p>&nbsp;</p>
<h2><a href="http://www.intelligencesquared.com/intelligence-squared-podcast/">Intelligence Squared</a></h2>
<p><img class="alignright size-medium wp-image-129" src="http://fredrikmeyer.net/wp-content/uploads/2017/02/3N0IaTFE-300x300.jpg" alt="" width="300" height="300" />Intelligence Squared arrangerer debatter og foredrag. Foredragene er gjerne kjente forfattere som forteller om sitt nyeste verk, og det blir stilt sp&oslash;rsm&aring;l etterp&aring;. Eksempler p&aring; forfattere som har snakket er Steven Pinker, Johan Norberg, Siddharta Mukerjee og Yuval Harari. Foredrag er en lettvint og rask m&aring;te &aring; f&aring; med seg de viktige og interessante ideene fra lange b&oslash;ker.</p>
<p>Forslag til episode: <a href="https://www.acast.com/intelligencesquared/stevenpinkeronthebetterangelsofournature-">foredraget til Steven Pinker</a> om hvordan verden har blitt et fredeligere sted.</p>
<h2><a href="http://www.econtalk.org/">Econ Talk</a></h2>
<p><img class="alignright size-full wp-image-130" src="http://fredrikmeyer.net/wp-content/uploads/2017/02/EconTalkCDcover.jpg" alt="" width="300" height="300" />Dette er en morsom og veldig l&aelig;rerik podcast om &oslash;konomi og samfunn. Verten, Russ Roberts, intervjuer forfatter og aktuelle personer om deres nyeste verker. Han skiller seg fra andre intervjuere i at han alltid har gjort en grundig jobb: han har lest b&oslash;kene deres, og stiller alltid mange kritiske sp&oslash;rsm&aring;l, noe som gj&oslash;r episodene mye mer interessante og l&aelig;rerike.</p>
<p>Det er mange interessante episoder, men en favoritt er kanskje en av de nyeste,&nbsp;som <a href="http://www.econtalk.org/archives/2017/01/sam_quinones_on.html">handler om den nye opioid-epidemien</a> i USA. Han snakker med Sam Quinones, som har skrevet bok om temaet.</p>
<h1><a href="https://dataskeptic.com/">Data Skeptic</a></h1>
<p><img class="alignright size-medium wp-image-161" src="http://fredrikmeyer.net/wp-content/uploads/2017/02/DataSkeptic-Podcast-1A-300x300.jpg" alt="" width="300" height="300" />Denne podcasten handler kanskje f&oslash;rst og fremst om maskinl&aelig;ring og kunstig intelligens, men har i det siste begynt &aring; snakke om interessante temaer innen kompleksitetsteori og kryptografi.</p>
<p>Enkelte av episodene er i "mini"-format, der temaer tas opp med p&aring; en&nbsp;<strong>veldig</strong> lettfattelig m&aring;te.</p>
<p>Favorittepisoden er kanskje <a href="https://dataskeptic.com/blog/episodes/2017/quantum-computing">denne</a> om kvantedatamaskiner med <a href="https://www.scottaaronson.com/blog/">Scott Aaronson</a>, en av mine favorittbloggere.</p>
<h1><a href="https://www.functionalgeekery.com/">Functional Geekery</a></h1>
<p><img class="alignright size-full wp-image-162" src="http://fredrikmeyer.net/wp-content/uploads/2017/02/functional-geekery_200x200.jpg" alt="" width="200" height="200" />Her intervjuer Steven Proctor forskjellige utviklere om deres bruk av funksjonell programmering og hvordan de kom inn i det.&nbsp; Podcasten er veldig fin for &aring; f&aring; innblikk i den menneskelige siden ved programmering og det &aring; l&aelig;re seg nye spr&aring;k.</p>
<p><a href="https://www.functionalgeekery.com/episode-111-stian-veum-mollersen/">Favorittepisoden</a> s&aring;langt er kanskje den hvor kollega <a href="https://twitter.com/mollerse">Stian Veum M&oslash;llersen</a> blir intervjuet om hvordan han begynte &aring; l&aelig;re seg om "s&aelig;re" programmeringsspr&aring;k.</p>
<h2>Andre som er verdt &aring; nevne</h2>
<p>Jeg mangler tid og vilje til &aring;&nbsp;nevne flere podcaster i s&aelig;rlig grad. Her nevner jeg raskt noen andre jeg h&oslash;rer mye p&aring;. To klassikere er selvsagt <a href="http://www.radiolab.org/">Radiolab</a> og <a href="https://www.thisamericanlife.org/">This American Life</a>, som begge faller i kategorien "ekstremt velproduserte interessante historier". Til slutt kan jeg nevne "<a href="http://www.programmingthrowdown.com/">Programming Throwdown</a>", som hver episode tar for seg et nytt programmeringsspr&aring;k p&aring; en lettfattelig m&aring;te. Jeg begynte &aring; h&oslash;re p&aring; dem i h&oslash;st (for et halvt &aring;r siden), og har n&aring; h&oslash;rt alle episodene i kronologisk rekkef&oslash;lge. Veldig l&aelig;rerikt og&nbsp;interessant.</p>
